[
    {
        "repo_name": "trailofbits/uthenticode",
        "CVE_ID": "CVE-2023-39969",
        "Problem_Type": "CWE-347",
        "Description": "uthenticode is a small cross-platform library for partially verifying Authenticode digital signatures. Version 1.0.9 of uthenticode hashed the entire file rather than hashing sections by virtual address, in violation of the Authenticode specification. As a result, an attacker could modify code within a binary without changing its Authenticode hash, making it appear valid from uthenticode's perspective. Versions of uthenticode prior to 1.0.9 are not vulnerable to this attack, nor are versions in the 2.x series. By design, uthenticode does not perform full-chain validation. However, the malleability of signature verification introduced in 1.0.9 was an unintended oversight. The 2.x series addresses the vulnerability. Versions prior to 1.0.9 are also not vulnerable, but users are encouraged to upgrade rather than downgrade. There are no workarounds to this vulnerability.",
        "URL": "https://github.com/trailofbits/uthenticode/pull/84",
        "Tag": "['Patch']",
        "fix_commit_hash": "8670b7bb9154d79c276483dcb7c9e9fd5e66455b",
        "inducing_commit_hash_pyszz": [
            "d16e9ec2b4d54c1333137ae34f011e9eb3e0b962"
        ],
        "inducing_commit_hash_pd": [
            "870b7a84121b70a68ff0b05919f5aba182298d13",
            "49b3bd517ae848763e53692e2d247202544dd583",
            "d16e9ec2b4d54c1333137ae34f011e9eb3e0b962",
            "e72f495e3942b5aa24c4cd14fd5b851cd8138daf",
            "fc9b17b26c506463035caad454f2f9401b04be31"
        ],
        "matched": [
            "d16e9ec2b4d54c1333137ae34f011e9eb3e0b962"
        ]
    },
    {
        "repo_name": "trailofbits/uthenticode",
        "CVE_ID": "CVE-2023-40012",
        "Problem_Type": "CWE-347",
        "Description": "uthenticode is a small cross-platform library for partially verifying Authenticode digital signatures. Versions of uthenticode prior to the 2.x series did not check Extended Key Usages in certificates, in violation of the Authenticode X.509 certificate profile. As a result, a malicious user could produce a \"signed\" PE file that uthenticode would verify and consider valid using an X.509 certificate that isn't entitled to produce code signatures (e.g., a SSL certificate). By design, uthenticode does not perform full-chain validation. However, the absence of EKU validation was an unintended oversight. The 2.0.0 release series includes EKU checks. There are no workarounds to this vulnerability.",
        "URL": "https://github.com/trailofbits/uthenticode/pull/78",
        "Tag": "['Patch']",
        "fix_commit_hash": "caeb1eb62412605f71bd96ce9bb9420644b6db53",
        "inducing_commit_hash_pyszz": [
            "aa41d3df02646347385afd97ccf9fa3148eeebeb"
        ],
        "inducing_commit_hash_pd": [
            "8145cd50b879dc927d240289037ce6fc98fadc2d",
            "aa41d3df02646347385afd97ccf9fa3148eeebeb"
        ],
        "matched": [
            "aa41d3df02646347385afd97ccf9fa3148eeebeb"
        ]
    }
]