[
    {
        "repo_name": "getsentry/sentry",
        "CVE_ID": "CVE-2023-36826",
        "Problem_Type": "CWE-863",
        "Description": "Sentry is an error tracking and performance monitoring platform. Starting in version 8.21.0 and prior to version 23.5.2, an authenticated user can download a debug or artifact bundle from arbitrary organizations and projects with a known bundle ID. The user does not need to be a member of the organization or have permissions on the project. A patch was issued in version 23.5.2 to ensure authorization checks are properly scoped on requests to retrieve debug or artifact bundles. Authenticated users who do not have the necessary permissions on the particular project are no longer able to download them. Sentry SaaS users do not need to take any action. Self-Hosted Sentry users should upgrade to version 23.5.2 or higher.",
        "URL": "https://github.com/getsentry/sentry/pull/49680",
        "Commit SHA": "e932b15435bf36239431eaa3790a6bcfa47046a9",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "getsentry/sentry",
        "CVE_ID": "CVE-2023-36829",
        "Problem_Type": "CWE-697",
        "Description": "Sentry is an error tracking and performance monitoring platform. Starting in version 23.6.0 and prior to version 23.6.2, the Sentry API incorrectly returns the `access-control-allow-credentials: true` HTTP header if the `Origin` request header ends with the `system.base-hostname` option of Sentry installation. This only affects installations that have `system.base-hostname` option explicitly set, as it is empty by default. Impact is limited since recent versions of major browsers have cross-site cookie blocking enabled by default. However, this flaw could allow other multi-step attacks. The patch has been released in Sentry 23.6.2.",
        "URL": "https://github.com/getsentry/sentry/pull/52276",
        "Commit SHA": "ee44c6be35e5e464bc40637580f39867898acd8b",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "getsentry/sentry",
        "CVE_ID": "CVE-2023-39349",
        "Problem_Type": "CWE-287",
        "Description": "Sentry is an error tracking and performance monitoring platform. Starting in version 22.1.0 and prior to version 23.7.2, an attacker with access to a token with few or no scopes can query `/api/0/api-tokens/` for a list of all tokens created by a user, including tokens with greater scopes, and use those tokens in other requests. There is no evidence that the issue was exploited on `sentry.io`. For self-hosted users, it is advised to rotate user auth tokens. A fix is available in version 23.7.2 of `sentry` and `self-hosted`. There are no known workarounds.",
        "URL": "https://github.com/getsentry/sentry/pull/53850",
        "Commit SHA": "fad12c1150d1135edf9666ea72ca11bc110c1083",
        "Tag": "['Patch']"
    }
]