[
    {
        "repo_name": "gocd/gocd",
        "CVE_ID": "CVE-2022-24832",
        "Problem_Type": "CWE-74",
        "Description": "GoCD is an open source a continuous delivery server. The bundled gocd-ldap-authentication-plugin included with the GoCD Server fails to correctly escape special characters when using the username to construct LDAP queries. While this does not directly allow arbitrary LDAP data exfiltration, it can allow an existing LDAP-authenticated GoCD user with malicious intent to construct and execute malicious queries, allowing them to deduce facts about other users or entries within the LDAP database (e.g alternate fields, usernames, hashed passwords etc) through brute force mechanisms. This only affects users who have a working LDAP authorization configuration enabled on their GoCD server, and only is exploitable by users authenticating using such an LDAP configuration. This issue has been fixed in GoCD 22.1.0, which is bundled with gocd-ldap-authentication-plugin v2.2.0-144.",
        "URL": "https://github.com/gocd/gocd/pull/10244",
        "Commit SHA": "717819c9cf416d8e34cf29bd569b7b040d8bf4c4",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "gocd/gocd",
        "CVE_ID": "CVE-2022-29182",
        "Problem_Type": "CWE-79",
        "Description": "GoCD is a continuous delivery server. GoCD versions 19.11.0 through 21.4.0 (inclusive) are vulnerable to a Document Object Model (DOM)-based cross-site scripting attack via a pipeline run's Stage Details > Graphs tab. It is possible for a malicious script on a attacker-hosted site to execute script that will run within the user's browser context and GoCD session via abuse of a messaging channel used for communication between with the parent page and the stage details graph's iframe. This could allow an attacker to steal a GoCD user's session cookies and/or execute malicious code in the user's context. This issue is fixed in GoCD 22.1.0. There are currently no known workarounds.",
        "URL": "https://github.com/gocd/gocd/pull/10190/commits/a256d05de1445e6c77843f098581fc6a66fe4477",
        "Commit SHA": "a256d05de1445e6c77843f098581fc6a66fe4477",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "gocd/gocd",
        "CVE_ID": "CVE-2022-29183",
        "Problem_Type": "CWE-79",
        "Description": "GoCD is a continuous delivery server. GoCD versions 20.2.0 until 21.4.0 are vulnerable to reflected cross-site scripting via abuse of the pipeline comparison function's error handling to render arbitrary HTML into the returned page. This could allow an attacker to trick a victim into executing code which would allow the attacker to operate on, or gain control over the same resources as the victim had access to. This issue is fixed in GoCD 21.4.0. As a workaround, block access to `/go/compare/.*` prior to GoCD Server via a reverse proxy, web application firewall or equivalent, which would prevent use of the pipeline comparison function.",
        "URL": "https://github.com/gocd/gocd/pull/9829/commits/bda81084c0401234b168437cf35a63390e3064d1",
        "Commit SHA": "bda81084c0401234b168437cf35a63390e3064d1",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "gocd/gocd",
        "CVE_ID": "CVE-2022-39310",
        "Problem_Type": "NVD-CWE-Other",
        "Description": "GoCD is a continuous delivery server. GoCD helps you automate and streamline the build-test-release cycle for continuous delivery of your product. GoCD versions prior to 21.1.0 can allow one authenticated agent to impersonate another agent, and thus receive work packages for other agents due to broken access control and incorrect validation of agent tokens within the GoCD server. Since work packages can contain sensitive information such as credentials intended only for a given job running against a specific agent environment, this can cause accidental information disclosure. Exploitation requires knowledge of agent identifiers and ability to authenticate as an existing agent with the GoCD server. This issue is fixed in GoCD version 21.1.0. There are currently no known workarounds.",
        "URL": "https://github.com/gocd/gocd/pull/8877",
        "Commit SHA": "3da524e56bd301e8a5f066afff37b03c4dd3773e",
        "Tag": "['Patch', 'Third Party Advisory']"
    }
]