[
    {
        "repo_name": "gravitl/netmaker",
        "CVE_ID": "CVE-2022-23650",
        "Problem_Type": "CWE-798",
        "Description": "Netmaker is a platform for creating and managing virtual overlay networks using WireGuard. Prior to versions 0.8.5, 0.9.4, and 010.0, there is a hard-coded cryptographic key in the code base which can be exploited to run admin commands on a remote server if the exploiter know the address and username of the admin. This effects the server (netmaker) component, and not clients. This has been patched in Netmaker v0.8.5, v0.9.4, and v0.10.0. There are currently no known workarounds.",
        "URL": "https://github.com/gravitl/netmaker/pull/781/commits/1bec97c662670dfdab804343fc42ae4b1d050a87",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "1bec97c662670dfdab804343fc42ae4b1d050a87"
    },
    {
        "repo_name": "gravitl/netmaker",
        "CVE_ID": "CVE-2023-32077",
        "Problem_Type": "CWE-798",
        "Description": "Netmaker makes networks with WireGuard. Prior to versions 0.17.1 and 0.18.6, hardcoded DNS key usage has been found in Netmaker allowing unauth users to interact with DNS API endpoints. The issue is patched in 0.17.1 and fixed in 0.18.6.  If users are using 0.17.1, they should run `docker pull gravitl/netmaker:v0.17.1` and `docker-compose up -d`. This will switch them to the patched users. If users are using v0.18.0-0.18.5, they should upgrade to v0.18.6 or later. As a workaround, someone who is using version 0.17.1 can pull the latest docker image of the backend and restart the server.",
        "URL": "https://github.com/gravitl/netmaker/pull/2170",
        "Tag": "['Patch']",
        "fix_commit_hash": "9362c39a9a822f0e07361aa7c77af2610597e657"
    },
    {
        "repo_name": "gravitl/netmaker",
        "CVE_ID": "CVE-2023-32078",
        "Problem_Type": "CWE-639",
        "Description": "Netmaker makes networks with WireGuard. An Insecure Direct Object Reference (IDOR) vulnerability was found in versions prior to 0.17.1 and 0.18.6 in the user update function. By specifying another user's username, it was possible to update the other user's password. The issue is patched in 0.17.1 and fixed in 0.18.6. If Users are using 0.17.1, they should run `docker pull gravitl/netmaker:v0.17.1` and `docker-compose up -d`. This will switch them to the patched users. If users are using v0.18.0-0.18.5, they should upgrade to v0.18.6 or later. As a workaround, someone using version 0.17.1 can pull the latest docker image of the backend and restart the server.",
        "URL": "https://github.com/gravitl/netmaker/pull/2158",
        "Tag": "['Patch']",
        "fix_commit_hash": "b3be57c65bf0bbfab43b66853c8e3637a43e2839"
    }
]