[
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2020-8296",
        "Problem_Type": "CWE-521",
        "Description": "Nextcloud Server prior to 20.0.0 stores passwords in a recoverable format even when external storage is not configured.",
        "URL": "https://github.com/nextcloud/server/pull/21037",
        "Commit SHA": "a2c262b68a0c64b808f77a8db4a1772f009de9de",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-22877",
        "Problem_Type": "CWE-862",
        "Description": "A missing user check in Nextcloud prior to 20.0.6 inadvertently populates a user's own credentials for other users external storage configuration when not already configured yet.",
        "URL": "https://github.com/nextcloud/server/pull/25224",
        "Commit SHA": "6129a851873287dde1f922b9d6f3aa4624a07133",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-22878",
        "Problem_Type": "CWE-79",
        "Description": "Nextcloud Server prior to 20.0.6 is vulnerable to reflected cross-site scripting (XSS) due to lack of sanitization in `OC.Notification.show`.",
        "URL": "https://github.com/nextcloud/server/pull/25234",
        "Commit SHA": "3478f39c0c72044ea10727b3c37bbb6f9fca5552",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-32678",
        "Problem_Type": "CWE-799",
        "Description": "Nextcloud Server is a Nextcloud package that handles data storage. In versions prior to 19.0.13, 20.0.11, and 21.0.3, ratelimits are not applied to OCS API responses. This affects any OCS API controller (`OCSController`) using the `@BruteForceProtection` annotation. Risk depends on the installed applications on the Nextcloud Server, but could range from bypassing authentication ratelimits or spamming other Nextcloud users. The vulnerability is patched in versions 19.0.13, 20.0.11, and 21.0.3. No workarounds aside from upgrading are known to exist.",
        "URL": "https://github.com/nextcloud/server/pull/27329",
        "Commit SHA": "5438e002761f91d4da5801b670264f2801a41763",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-32679",
        "Problem_Type": "CWE-116",
        "Description": "Nextcloud Server is a Nextcloud package that handles data storage. In versions prior to 19.0.13, 20.0.11, and 21.0.3, filenames where not escaped by default in controllers using `DownloadResponse`. When a user-supplied filename was passed unsanitized into a `DownloadResponse`, this could be used to trick users into downloading malicious files with a benign file extension. This would show in UI behaviours where Nextcloud applications would display a benign file extension (e.g. JPEG), but the file will actually be downloaded with an executable file extension. The vulnerability is patched in versions 19.0.13, 20.0.11, and 21.0.3. Administrators of Nextcloud instances do not have a workaround available, but developers of Nextcloud apps may manually escape the file name before passing it into `DownloadResponse`.",
        "URL": "https://github.com/nextcloud/server/pull/27354",
        "Commit SHA": "0bbb195af19ddfc1a4fb15623f973c0c47deb16a",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-32680",
        "Problem_Type": "CWE-778",
        "Description": "Nextcloud Server is a Nextcloud package that handles data storage. In versions priot to 19.0.13, 20.0.11, and 21.0.3, Nextcloud Server audit logging functionality wasn't properly logging events for the unsetting of a share expiration date. This event is supposed to be logged. This issue is patched in versions 19.0.13, 20.0.11, and 21.0.3.",
        "URL": "https://github.com/nextcloud/server/pull/27024",
        "Commit SHA": "fd284f428dc15c0ebd4054fa5e4e9431d518bcb1",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-32688",
        "Problem_Type": "CWE-285",
        "Description": "Nextcloud Server is a Nextcloud package that handles data storage. Nextcloud Server supports application specific tokens for authentication purposes. These tokens are supposed to be granted to a specific applications (e.g. DAV sync clients), and can also be configured by the user to not have any filesystem access. Due to a lacking permission check, the tokens were able to change their own permissions in versions prior to 19.0.13, 20.0.11, and 21.0.3. Thus fileystem limited tokens were able to grant themselves access to the filesystem. The issue is patched in versions 19.0.13, 20.0.11, and 21.0.3. There are no known workarounds aside from upgrading.",
        "URL": "https://github.com/nextcloud/server/pull/27000",
        "Commit SHA": "e008b7915e83c07cdc9c4ad89b1498d4857786a3",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-32703",
        "Problem_Type": "CWE-799",
        "Description": "Nextcloud Server is a Nextcloud package that handles data storage. In versions prior to 19.0.13, 20.011, and 21.0.3, there was a lack of ratelimiting on the shareinfo endpoint. This may have allowed an attacker to enumerate potentially valid share tokens. The issue was fixed in versions 19.0.13, 20.0.11, and 21.0.3. There are no known workarounds.",
        "URL": "https://github.com/nextcloud/server/pull/26945",
        "Commit SHA": "024ed97e7eef00f51d896672aee6bf7684619870",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-32705",
        "Problem_Type": "CWE-799",
        "Description": "Nextcloud Server is a Nextcloud package that handles data storage. In versions prior to 19.0.13, 20.011, and 21.0.3, there was a lack of ratelimiting on the public DAV endpoint. This may have allowed an attacker to enumerate potentially valid share tokens or credentials. The issue was fixed in versions 19.0.13, 20.0.11, and 21.0.3. There are no known workarounds.",
        "URL": "https://github.com/nextcloud/server/pull/27610",
        "Commit SHA": "092ff40f154b310c3c0397d87c7be30e1e7cbbc4",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-32725",
        "Problem_Type": "CWE-277",
        "Description": "Nextcloud Server is a Nextcloud package that handles data storage. In versions prior to 19.0.13, 20.011, and 21.0.3, default share permissions were not being respected for federated reshares of files and folders. The issue was fixed in versions 19.0.13, 20.0.11, and 21.0.3. There are no known workarounds.",
        "URL": "https://github.com/nextcloud/server/pull/26946",
        "Commit SHA": "c4fddd9b5c176a5322745774f22665a385fa45f9",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-32741",
        "Problem_Type": "NVD-CWE-Other",
        "Description": "Nextcloud Server is a Nextcloud package that handles data storage. In versions prior to 19.0.13, 20.011, and 21.0.3, there was a lack of ratelimiting on the public share link mount endpoint. This may have allowed an attacker to enumerate potentially valid share tokens. The issue was fixed in versions 19.0.13, 20.0.11, and 21.0.3. There are no known workarounds.",
        "URL": "https://github.com/nextcloud/server/pull/26958",
        "Commit SHA": "9b36252de0f7cc6b971c8a23524495e38f35dcf2",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-32800",
        "Problem_Type": "CWE-306",
        "Description": "Nextcloud server is an open source, self hosted personal cloud. In affected versions an attacker is able to bypass Two Factor Authentication in Nextcloud. Thus knowledge of a password, or access to a WebAuthN trusted device of a user was sufficient to gain access to an account. It is recommended that the Nextcloud Server is upgraded to 20.0.12, 21.0.4 or 22.1.0. There are no workaround for this vulnerability.",
        "URL": "https://github.com/nextcloud/server/pull/28078",
        "Commit SHA": "41eec84ade3541574b0ffa966d13915b407f5c5f",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-41177",
        "Problem_Type": "CWE-799",
        "Description": "Nextcloud is an open-source, self-hosted productivity platform. Prior to versions 20.0.13, 21.0.5, and 22.2.0, Nextcloud Server did not implement a database backend for rate-limiting purposes. Any component of Nextcloud using rate-limits (as as `AnonRateThrottle` or `UserRateThrottle`) was thus not rate limited on instances not having a memory cache backend configured. In the case of a default installation, this would notably include the rate-limits on the two factor codes. It is recommended that the Nextcloud Server be upgraded to 20.0.13, 21.0.5, or 22.2.0. As a workaround, enable a memory cache backend in `config.php`.",
        "URL": "https://github.com/nextcloud/server/pull/28728",
        "Commit SHA": "0dcc5c0e9f346912ed8c263950ad91f35a41bff8",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-41178",
        "Problem_Type": "CWE-434",
        "Description": "Nextcloud is an open-source, self-hosted productivity platform. Prior to versions 20.0.13, 21.0.5, and 22.2.0, a file traversal vulnerability makes an attacker able to download arbitrary SVG images from the host system, including user provided files. This could also be leveraged into a XSS/phishing attack, an attacker could upload a malicious SVG file that mimics the Nextcloud login form and send a specially crafted link to victims. The XSS risk here is mitigated due to the fact that Nextcloud employs a strict Content-Security-Policy disallowing execution of arbitrary JavaScript. It is recommended that the Nextcloud Server be upgraded to 20.0.13, 21.0.5 or 22.2.0. There are no known workarounds aside from upgrading.",
        "URL": "https://github.com/nextcloud/server/pull/28726",
        "Commit SHA": "d4d1f5dfce49e079feb0b6a826f007b0c99ab16f",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-41179",
        "Problem_Type": "CWE-304",
        "Description": "Nextcloud is an open-source, self-hosted productivity platform. Prior to Nextcloud Server versions 20.0.13, 21.0.5, and 22.2.0, the Two-Factor Authentication wasn't enforced for pages marked as public. Any page marked as `@PublicPage` could thus be accessed with a valid user session that isn't authenticated. This particularly affects the Nextcloud Talk application, as this could be leveraged to gain access to any private chat channel without going through the Two-Factor flow. It is recommended that the Nextcloud Server be upgraded to 20.0.13, 21.0.5 or 22.2.0. There are no known workarounds aside from upgrading.",
        "URL": "https://github.com/nextcloud/server/pull/28725",
        "Commit SHA": "c21a721fc16a815fc4fe61423dccae4f22a6c894",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-41239",
        "Problem_Type": "CWE-200",
        "Description": "Nextcloud server is a self hosted system designed to provide cloud style services. In affected versions the User Status API did not consider the user enumeration settings by the administrator. This allowed a user to enumerate other users on the instance, even when user listings where disabled. It is recommended that the Nextcloud Server is upgraded to 20.0.14, 21.0.6 or 22.2.1. There are no known workarounds.",
        "URL": "https://github.com/nextcloud/server/pull/29260",
        "Commit SHA": "8ae93a7baf30b7db992cfa20793af67efbb5748b",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2021-41241",
        "Problem_Type": "CWE-863",
        "Description": "Nextcloud server is a self hosted system designed to provide cloud style services. The groupfolders application for Nextcloud allows sharing a folder with a group of people. In addition, it allows setting \"advanced permissions\" on subfolders, for example, a user could be granted access to the groupfolder but not specific subfolders. Due to a lacking permission check in affected versions, a user could still access these subfolders by copying the groupfolder to another location. It is recommended that the Nextcloud Server is upgraded to 20.0.14, 21.0.6 or 22.2.1. Users unable to upgrade should disable the \"groupfolders\" application in the admin settings.",
        "URL": "https://github.com/nextcloud/server/pull/29362",
        "Commit SHA": "5d9474d324a8e368751d72db3692fcd895a29115",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-24741",
        "Problem_Type": "CWE-770",
        "Description": "Nextcloud server is an open source, self hosted cloud style services platform. In affected versions an attacker can cause a denial of service by uploading specially crafted files which will cause the server to allocate too much memory / CPU. It is recommended that the Nextcloud Server is upgraded to 21.0.8 , 22.2.4 or 23.0.1. Users unable to upgrade should disable preview generation with the `'enable_previews'` config flag.",
        "URL": "https://github.com/nextcloud/server/pull/30291",
        "Commit SHA": "c47406ad3cc1606d7357af6c32c4fa7dd0ac53a7",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-24888",
        "Problem_Type": "NVD-CWE-Other",
        "Description": "Nextcloud Server is the file server software for Nextcloud, a self-hosted productivity platform. Prior to versions 20.0.14.4, 21.0.8, 22.2.4, and 23.0.1, it is possible to create files and folders that have leading and trailing \\n, \\r, \\t, and \\v characters. The server rejects files and folders that have these characters in the middle of their names, so this might be an opportunity for injection. This issue is fixed in versions 20.0.14.4, 21.0.8, 22.2.4, and 23.0.1. There are currently no known workarounds.",
        "URL": "https://github.com/nextcloud/server/pull/29895",
        "Commit SHA": "d9d54ce782d34656d2e53cb7588fcad80182a1fe",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-29243",
        "Problem_Type": "CWE-20",
        "Description": "Nextcloud Server is the file server software for Nextcloud, a self-hosted productivity platform. Prior to versions 22.2.7 and 23.0.4, missing input-size validation of new session names allows users to create app passwords with long names. These long names are then loaded into memory on usage, resulting in impacted performance. Versions 22.2.7 and 23.0.4 contain a fix for this issue. There are currently no known workarounds available.",
        "URL": "https://github.com/nextcloud/server/pull/31658",
        "Commit SHA": "c1215f573ae98fb3cf66f9ff5dc408574a7df560",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-31014",
        "Problem_Type": "CWE-74",
        "Description": "Nextcloud server is an open source personal cloud server. Affected versions were found to be vulnerable to SMTP command injection. The impact varies based on which commands are supported by the backend SMTP server. However, the main risk here is that the attacker can then hijack an already-authenticated SMTP session and run arbitrary SMTP commands as the email user, such as sending emails to other users, changing the FROM user, and so on. As before, this depends on the configuration of the server itself, but newlines should be sanitized to mitigate such arbitrary SMTP command injection. It is recommended that the Nextcloud Server is upgraded to 22.2.8 , 23.0.5 or 24.0.1. There are no known workarounds for this issue.",
        "URL": "https://github.com/nextcloud/server/pull/32428",
        "Commit SHA": "4cd0b2253df2fdbb43d91b9331a63fa5afcb4326",
        "Tag": "['Issue Tracking', 'Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-31118",
        "Problem_Type": "CWE-307",
        "Description": "Nextcloud server is an open source personal cloud solution. In affected versions an attacker could brute force to find if federated sharing is being used and potentially try to brute force access tokens for federated shares (`a-zA-Z0-9` ^ 15). It is recommended that the Nextcloud Server is upgraded to 22.2.9, 23.0.6 or 24.0.2. Users unable to upgrade may disable federated sharing via the Admin Sharing settings in `index.php/settings/admin/sharing`.",
        "URL": "https://github.com/nextcloud/server/pull/32843/commits/6eb692da7fe73c899cb6a8d2aa045eddb1f14018",
        "Commit SHA": "6eb692da7fe73c899cb6a8d2aa045eddb1f14018",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-31120",
        "Problem_Type": "NVD-CWE-Other",
        "Description": "Nextcloud server is an open source personal cloud solution. The audit log is used to get a full trail of the actions which has been incompletely populated. In affected versions federated share events were not properly logged which would allow brute force attacks to go unnoticed. This behavior exacerbates the impact of CVE-2022-31118. It is recommended that the Nextcloud Server is upgraded to 22.2.7, 23.0.4 or 24.0.0. There are no workarounds available.",
        "URL": "https://github.com/nextcloud/server/pull/31594/commits/1d8bf9a89c6856218802a1d365000a5831be8655",
        "Commit SHA": "1d8bf9a89c6856218802a1d365000a5831be8655",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-36074",
        "Problem_Type": "CWE-863",
        "Description": "Nextcloud server is an open source personal cloud product. Affected versions of this package are vulnerable to Information Exposure which fails to strip the Authorization header on HTTP downgrade. This can lead to account access exposure and compromise. It is recommended that the Nextcloud Server is upgraded to 23.0.7 or 24.0.3. It is recommended that the Nextcloud Enterprise Server is upgraded to 22.2.11, 23.0.7 or 24.0.3. There are no known workarounds for this issue.",
        "URL": "https://github.com/nextcloud/server/pull/32941",
        "Commit SHA": "07ab8b3e677715b520ef259d41c415d28e9638e9",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-39211",
        "Problem_Type": "CWE-918",
        "Description": "Nextcloud server is an open source personal cloud platform. In affected versions it was found that locally running webservices can be found and requested erroneously. It is recommended that the Nextcloud Server is upgraded to 23.0.8 or 24.0.4. It is recommended that the Nextcloud Enterprise Server is upgraded to 22.2.10.4, 23.0.8 or 24.0.4. There are no known workarounds for this issue.",
        "URL": "https://github.com/nextcloud/server/pull/32988",
        "Commit SHA": "859d7fc4b00252626d2976d345077915c1068dad",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-39211",
        "Problem_Type": "CWE-918",
        "Description": "Nextcloud server is an open source personal cloud platform. In affected versions it was found that locally running webservices can be found and requested erroneously. It is recommended that the Nextcloud Server is upgraded to 23.0.8 or 24.0.4. It is recommended that the Nextcloud Enterprise Server is upgraded to 22.2.10.4, 23.0.8 or 24.0.4. There are no known workarounds for this issue.",
        "URL": "https://github.com/nextcloud/server/pull/33031",
        "Commit SHA": "7615536977eda7f3bda5c29eaa780a323c97afc7",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-39329",
        "Problem_Type": "CWE-862",
        "Description": "Nextcloud Server is the file server software for Nextcloud, a self-hosted productivity platform. Nextcloud Server and Nextcloud Enterprise Server prior to versions 23.0.9 and 24.0.5 are vulnerable to exposure of information that cannot be controlled by administrators without direct database access. Versions 23.0.9 and 24.0.5 contains patches for this issue. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/33643",
        "Commit SHA": "b5a40423915de01912f2e9a3460219ee3f1cbf44",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-39346",
        "Problem_Type": "CWE-20",
        "Description": "Nextcloud server is an open source personal cloud server. Affected versions of nextcloud server did not properly limit user display names which could allow a malicious users to overload the backing database and cause a denial of service. It is recommended that the Nextcloud Server is upgraded to 22.2.10, 23.0.7 or 24.0.3. There are no known workarounds for this issue.",
        "URL": "https://github.com/nextcloud/server/pull/33052",
        "Commit SHA": "744f1dd5638c7924be9c19621033d67991c65fd2",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-39364",
        "Problem_Type": "CWE-312",
        "Description": "Nextcloud Server is the file server software for Nextcloud, a self-hosted productivity platform. In Nextcloud Server prior to versions 23.0.9 and 24.0.5 and Nextcloud Enterprise Server prior to versions 22.2.10.5, 23.0.9, and 24.0.5 an attacker reading `nextcloud.log` may gain knowledge of credentials to connect to a SharePoint service. Nextcloud Server versions 23.0.9 and 24.0.5 and Nextcloud Enterprise Server versions 22.2.10.5, 23.0.9, and 24.0.5 contain a patch for this issue. As a workaround, set `zend.exception_ignore_args = On` as an option in `php.ini`.",
        "URL": "https://github.com/nextcloud/server/pull/33689",
        "Commit SHA": "f1301097b0fec6f118b4216f50a59134d35cf043",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-41882",
        "Problem_Type": "CWE-94",
        "Description": "The Nextcloud Desktop Client is a tool to synchronize files from Nextcloud Server with your computer. In version 3.6.0, if a user received a malicious file share and has it synced locally or the virtual filesystem enabled and clicked a nc://open/ link it will open the default editor for the file type of the shared file, which on Windows can also sometimes mean that a file depending on the type, e.g. \"vbs\", is being executed. It is recommended that the Nextcloud Desktop client is upgraded to version 3.6.1. As a workaround, users can block the Nextcloud Desktop client 3.6.0 by setting the `minimum.supported.desktop.version` system config to `3.6.1` on the server, so new files designed to use this attack vector are not downloaded anymore. Already existing files can still be used. Another workaround would be to enforce shares to be accepted by setting the `sharing.force_share_accept` system config to `true` on the server, so new files designed to use this attack vector are not downloaded anymore. Already existing shares can still be abused.",
        "URL": "https://github.com/nextcloud/server/pull/34559",
        "Commit SHA": "eeeade06ebfa9f0f94d776ad4000c440c94fe744",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-41968",
        "Problem_Type": "CWE-1284",
        "Description": "Nextcloud Server is an open source personal cloud server. Prior to versions 23.0.10 and 24.0.5, calendar name lengths are not validated before writing to a database. As a result, an attacker can send unnecessary amounts of data against the database. Version 23.0.10 and 24.0.5 contain patches for the issue. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/33139",
        "Commit SHA": "fa466a093cef75abaf0696421f4a9b640122242c",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-41969",
        "Problem_Type": "CWE-521",
        "Description": "Nextcloud Server is an open source personal cloud server. Prior to versions 23.0.11, 24.0.7, and 25.0.0, there is no password length limit when creating a user as an administrator. An administrator can cause a limited DoS attack against their own server. Versions 23.0.11, 24.0.7, and 25.0.0 contain a fix for the issue. As a workaround, don't create user accounts with long passwords.",
        "URL": "https://github.com/nextcloud/server/pull/34500",
        "Commit SHA": "719c9c3655068f55bab92f106f06d6d8760df5da",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2022-41970",
        "Problem_Type": "CWE-863",
        "Description": "Nextcloud Server is an open source personal cloud server. Prior to versions 24.0.7 and 25.0.1, disabled download shares still allow download through preview images. Images could be downloaded and previews of documents (first page) can be downloaded without being watermarked. Versions 24.0.7 and 25.0.1 contain a fix for this issue. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/34788",
        "Commit SHA": "aec8dce61acb4e0b6ce1019fd0136fab7885bb23",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-25161",
        "Problem_Type": "NVD-CWE-noinfo",
        "Description": "Nextcloud Server is the file server software for Nextcloud, a self-hosted productivity platform. Nextcloud Server and Nextcloud Enterprise Server prior to versions 25.0.1 24.0.8, and 23.0.12 missing rate limiting on password reset functionality. This could result in service slowdown, storage overflow, or cost impact when using external email services. Users should upgrade to Nextcloud Server 25.0.1, 24.0.8, or 23.0.12 or Nextcloud Enterprise Server 25.0.1, 24.0.8, or 23.0.12 to receive a patch. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/34632",
        "Commit SHA": "3d0e8182badf44758d164d65c13661db66559bea",
        "Tag": "['Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-25579",
        "Problem_Type": "CWE-22",
        "Description": "Nextcloud server is a self hosted home cloud product. In affected versions the `OC\\Files\\Node\\Folder::getFullPath()` function was validating and normalizing the string in the wrong order. The function is used in the `newFile()` and `newFolder()` items, which may allow to creation of paths outside of ones own space and overwriting data from other users with crafted paths. This issue has been addressed in versions 25.0.2, 24.0.8, and 23.0.12. Users are advised to upgrade. There are no known workarounds for this issue.",
        "URL": "https://github.com/nextcloud/server/pull/35074",
        "Commit SHA": "c1ba14ad00cc751f1e5aed4794b7f673462d0a00",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-25816",
        "Problem_Type": "CWE-400",
        "Description": "Nextcloud is an Open Source private cloud software. Versions 25.0.0 and above, prior to 25.0.3, are subject to Uncontrolled Resource Consumption. A user can configure a very long password, consuming more resources on password validation than desired. This issue is patched in 25.0.3 No workaround is available.\n",
        "URL": "https://github.com/nextcloud/server/pull/35965",
        "Commit SHA": "ce50acd9b2d7acb3f04fd7c7940e821cb3d76a71",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-25817",
        "Problem_Type": "CWE-732",
        "Description": "Nextcloud server is an open source, personal cloud implementation. In versions from 24.0.0 and before 24.0.9 a user could escalate their permissions to delete files they were not supposed to deletable but only viewed or downloaded. This issue has been addressed andit is recommended that the Nextcloud Server is upgraded to 24.0.9. There are no known workarounds for this vulnerability.",
        "URL": "https://github.com/nextcloud/server/pull/33941",
        "Commit SHA": "02d55eb90fdc61137745c5e5b3d8c7330e0717c2",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-25818",
        "Problem_Type": "CWE-307",
        "Description": "Nextcloud server is an open source, personal cloud implementation. In affected versions a malicious user could try to reset the password of another user and then brute force the 62^21 combinations for the password reset token. As of commit `704eb3aa` password reset attempts are now throttled. Note that 62^21 combinations would significant compute resources to brute force. None the less it is recommended that the Nextcloud Server is upgraded to 24.0.10 or 25.0.4. There are no known workarounds for this vulnerability.",
        "URL": "https://github.com/nextcloud/server/pull/36489/commits/704eb3aa6cecc0a646f5cca4290b595f493f9ed3",
        "Commit SHA": "704eb3aa6cecc0a646f5cca4290b595f493f9ed3",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-25820",
        "Problem_Type": "CWE-307",
        "Description": "Nextcloud Server is the file server software for Nextcloud, a self-hosted productivity platform, and Nextcloud Enterprise Server is the enterprise version of the file server software. In Nextcloud Server versions 25.0.x prior to 25.0.5 and versions 24.0.x prior to 24.0.10 as well as Nextcloud Enterprise Server versions 25.0.x prior to 25.0.4, 24.0.x prior to 24.0.10, 23.0.x prior to 23.0.12.5, 22.x prior to 22.2.0.10, and 21.x prior to 21.0.9.10, when an attacker gets access to an already logged in user session they can then brute force the password on the confirmation endpoint. Nextcloud Server should upgraded to 24.0.10 or 25.0.4 and Nextcloud Enterprise Server should upgraded to 21.0.9.10, 22.2.10.10, 23.0.12.5, 24.0.10, or 25.0.4 to receive a patch. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/36489",
        "Commit SHA": "59578817f5cef0726f17301396c60dc2c92cba4d",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-25821",
        "Problem_Type": "NVD-CWE-Other",
        "Description": "Nextcloud is an Open Source private cloud software. Versions 24.0.4 and above, prior to 24.0.7, and 25.0.0 and above, prior to 25.0.1, contain Improper Access Control. Secure view for internal shares can be circumvented if reshare permissions are also given. This issue is patched in versions 24.0.7 and 25.0.1. No workaround  is available.",
        "URL": "https://github.com/nextcloud/server/pull/34502",
        "Commit SHA": "0de71a73e576336121358d9db684c9755d4dfda4",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-28643",
        "Problem_Type": "CWE-706",
        "Description": "Nextcloud server is an open source home cloud implementation. In affected versions when a recipient receives 2 shares with the same name, while a memory cache is configured, the second share will replace the first one instead of being renamed to `{name} (2)`. It is recommended that the Nextcloud Server is upgraded to 25.0.3 or 24.0.9. Users unable to upgrade should avoid sharing 2 folders with the same name to the same user.",
        "URL": "https://github.com/nextcloud/server/pull/36047",
        "Commit SHA": "10ab0f2280b663acd55b0fa2c06f4490b01a908c",
        "Tag": "['Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-28644",
        "Problem_Type": "NVD-CWE-noinfo",
        "Description": "Nextcloud server is an open source home cloud implementation. In releases of the 25.0.x branch before 25.0.3 an inefficient fetch operation may impact server performances and/or can lead to a denial of service. This issue has been addressed and it is recommended that the Nextcloud Server is upgraded to 25.0.3. There are no known workarounds for this vulnerability.\n",
        "URL": "https://github.com/nextcloud/server/pull/36016",
        "Commit SHA": "a36848ce7f014fad8ce50930600e92655355a626",
        "Tag": "['Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-28833",
        "Problem_Type": "CWE-434",
        "Description": "Nextcloud server is an open source home cloud implementation. In affected versions admins of a server were able to upload a logo or a favicon and to provided a file name which was not restricted and could overwrite files in the appdata directory. Administrators may have access to overwrite these files by other means but this method could be exploited by tricking an admin into uploading a maliciously named file. It is recommended that the Nextcloud Server is upgraded to 24.0.10 or 25.0.4. Users unable to upgrade should avoid ingesting logo files from untrusted sources.",
        "URL": "https://github.com/nextcloud/server/pull/36095",
        "Commit SHA": "dc4c3bc8bccfc67a25228f45cee4052d88ead28c",
        "Tag": "['Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-28834",
        "Problem_Type": "CWE-212",
        "Description": "Nextcloud Server is an open source personal cloud server. Nextcloud Server 24.0.0 until 24.0.6 and 25.0.0 until 25.0.4, as well as Nextcloud Enterprise Server 23.0.0 until 23.0.11, 24.0.0 until 24.0.6, and 25.0.0 until 25.0.4, have an information disclosure vulnerability. A user was able to get the full data directory path of the Nextcloud server from an API endpoint. By itself this information is not problematic as it can also be guessed for most common setups, but it could speed up other unknown attacks in the future if the information is known. Nextcloud Server 24.0.6 and 25.0.4 and Nextcloud Enterprise Server 23.0.11, 24.0.6, and 25.0.4 contain patches for this issue. There are no known workarounds.",
        "URL": "https://github.com/nextcloud/server/pull/36094",
        "Commit SHA": "614e3e29690b23f2fb6b6e2a15079fe8482e58b9",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-28835",
        "Problem_Type": "CWE-338",
        "Description": "Nextcloud server is an open source home cloud implementation. In affected versions the generated fallback password when creating a share was using a weak complexity random number generator, so when the sharer did not change it the password could be guessable to an attacker willing to brute force it. It is recommended that the Nextcloud Server is upgraded to 24.0.10 or 25.0.4. This issue only affects users who do not have a password policy enabled, so enabling a password policy is an effective mitigation for users unable to upgrade.",
        "URL": "https://github.com/nextcloud/server/pull/36093",
        "Commit SHA": "7f81ce55470845239a80ce3c426e29713fc4575c",
        "Tag": "['Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-28844",
        "Problem_Type": "CWE-284",
        "Description": "Nextcloud server is an open source home cloud implementation. In affected versions users that should not be able to download a file can still download an older version and use that for uncontrolled distribution. This issue has been addressed in versions 24.0.10 and 25.0.4. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
        "URL": "https://github.com/nextcloud/server/pull/36113",
        "Commit SHA": "60eac3fec589f69bbeed21e2b0108c2055afc0ca",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-28847",
        "Problem_Type": "CWE-307",
        "Description": "Nextcloud Server is the file server software for Nextcloud, a self-hosted productivity platform. In Nextcloud Server 24.0.0 prior to 24.0.11 and 25.0.0 prior to 25.0.5; as well as Nextcloud Server Enterprise 23.0.0 prior to 23.0.12.6, 24.0.0 prior to 24.0.11, and 25.0.0 prior to 25.0.5; an attacker is not restricted in verifying passwords of share links so they can just start brute forcing the password. Nextcloud Server 24.0.11 and 25.0.5 and Nextcloud Enterprise Server 23.0.12.6, 24.0.11, and 25.0.5 contain a fix for this issue. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/35057",
        "Commit SHA": "1357cf619189cf8229f2e860416f932dd559f6af",
        "Tag": "['Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-30539",
        "Problem_Type": "NVD-CWE-noinfo",
        "Description": "Nextcloud is a personal home server system. Depending on the set up tags and other workflows this issue can be used to limit access of others or being able to grant them access when there are system tag based files access control or files retention rules. It is recommended that the Nextcloud Server is upgraded to 24.0.11 or 25.0.5, the Nextcloud Enterprise Server to 21.0.9.11, 22.2.10.11, 23.0.12.6, 24.0.11 or 25.0.5, and the Nextcloud Files automated tagging app to 1.11.1, 1.12.1, 1.13.1, 1.14.2, 1.15.3 or 1.16.1. Users unable to upgrade should disable all workflow related apps. Users are advised to upgrade.",
        "URL": "https://github.com/nextcloud/server/pull/37252",
        "Commit SHA": "95048100ed4bec4c91b0442c2e0999b71ae7d3fb",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-32319",
        "Problem_Type": "CWE-307",
        "Description": "Nextcloud server is an open source personal cloud implementation. Missing brute-force protection on the WebDAV endpoints via the basic auth header allowed to brute-force user credentials when the provided user name was not an email address. Users from version 24.0.0 onward are affected. This issue has been addressed in releases 24.0.11, 25.0.5 and 26.0.0. Users are advised to upgrade. There are no known workarounds for this vulnerability.",
        "URL": "https://github.com/nextcloud/server/pull/37227",
        "Commit SHA": "a30d7c51d361edd75c9b1d7f539f220a5a81be2e",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-32320",
        "Problem_Type": "CWE-307",
        "Description": "Nextcloud Server is a data storage system for Nextcloud, a self-hosted productivity platform. When multiple requests are sent in parallel, all of them were executed even if the amount of faulty requests succeeded the limit by the time the response was sent to the client. This allowed someone to send as many requests the server could handle in parallel to bruteforce protected details instead of the configured limit, default 8. Nextcloud Server versions 25.0.7 and 26.0.2 and Nextcloud Enterprise Server versions 21.0.9.12, 22.2.10.12, 23.0.12.7, 24.0.12.2, 25.0.7 and 26.0.2 contain patches for this issue.\n",
        "URL": "https://github.com/nextcloud/server/pull/38274",
        "Commit SHA": "5e02def3f49a56701a3facfb9dc82ef0fff703d5",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-35171",
        "Problem_Type": "CWE-601",
        "Description": "NextCloud Server and NextCloud Enterprise Server provide file storage for Nextcloud, a self-hosted productivity platform. Starting in version 26.0.0 and prior to version 26.0.2, an attacker could supply a URL that redirects an unsuspecting victim from a legitimate domain to an attacker's site. Nextcloud Server and Nextcloud Enterprise Server 26.0.2 contain a patch for this issue. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/38194",
        "Commit SHA": "e1768485db5942600ee8cb335980602a3b492747",
        "Tag": "['Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-39952",
        "Problem_Type": "CWE-284",
        "Description": "Nextcloud Server provides data storage for Nextcloud, an open source cloud platform. Starting in version 22.0.0 and prior to versions 22.2.10.13, 23.0.12.8, 24.0.12.4, 25.0.8, 26.0.3, and 27.0.1, a user can access files inside a subfolder of a groupfolder accessible to them, even if advanced permissions would block access to the subfolder. Nextcloud Server versions 25.0.8, 26.0.3, and 27.0.1 and Nextcloud Enterprise Server versions 22.2.10.13, 23.0.12.8, 24.0.12.4, 25.0.8, 26.0.3, and 27.0.1 contain a patch for this issue. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/38890",
        "Commit SHA": "bec4f76e6b1b064c39f9756c516e1833fe2efb12",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-39958",
        "Problem_Type": "CWE-307",
        "Description": "Nextcloud Server provides data storage for Nextcloud, an open source cloud platform. Starting in version 22.0.0 and prior to versions 22.2.10.13, 23.0.12.8, 24.0.12.5, 25.0.9, 26.0.4, and 27.0.1, missing protection allows an attacker to brute force the client secrets of configured OAuth2 clients. Nextcloud Server versions 25.0.9, 26.0.4, and 27.0.1 and Nextcloud Enterprise Server versions 22.2.10.13, 23.0.12.8, 24.0.12.5, 25.0.9, 26.0.4, and 27.0.1 contain a patch for this issue. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/38773",
        "Commit SHA": "247c874b5122be6a8c2bb679d2b9d495bb59d761",
        "Tag": "['Patch', 'Vendor Advisory']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-39959",
        "Problem_Type": "CWE-284",
        "Description": "Nextcloud Server provides data storage for Nextcloud, an open source cloud platform. Starting in version 25.0.0 and prior to versions 25.0.9, 26.0.4, and 27.0.1, unauthenticated users could send a DAV request which reveals whether a calendar or an address book with the given identifier exists for the victim. Nextcloud Server versions 25.0.9, 26.0.4, and 27.0.1 and Nextcloud Enterprise Server versions 25.0.9, 26.0.4, and 27.0.1 contain a patch for this issue. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/38747",
        "Commit SHA": "e9d8dbf53c76670e84bee1c74630e09aca5d7d77",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-39960",
        "Problem_Type": "CWE-307",
        "Description": "Nextcloud Server provides data storage for Nextcloud, an open source cloud platform. In Nextcloud Server starting with 25.0.0 and prior to 25.09 and 26.04; as well as Nextcloud Enterprise Server starting with 22.0.0 and prior to 22.2.10.14, 23.0.12.9, 24.0.12.5, 25.0.9, and 26.0.4; missing protection allows an attacker to brute force passwords on the WebDAV API. Nextcloud Server 25.0.9 and 26.0.4 and Nextcloud Enterprise Server 22.2.10.14, 23.0.12.9, 24.0.12.5, 25.0.9, and 26.0.4 contain patches for this issue. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/38046",
        "Commit SHA": "b44de9ccb8395dcaacbf1a8ceee31868188e63e6",
        "Tag": "['Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-39962",
        "Problem_Type": "CWE-284",
        "Description": "Nextcloud Server provides data storage for Nextcloud, an open source cloud platform. Starting in version 19.0.0 and prior to versions 19.0.13.10, 20.0.14.15, 21.0.9.13, 22.2.10.14, 23.0.12.8, 24.0.12.5, 25.0.9, 26.0.4, and 27.0.1, a malicious user could delete any personal or global external storage, making them inaccessible for everyone else as well. Nextcloud server versions 25.0.9, 26.0.4, and 27.0.1 and Nextcloud Enterprise Server versions 19.0.13.10, 20.0.14.15, 21.0.9.13, 22.2.10.14, 23.0.12.9, 24.0.12.5, 25.0.9, 26.0.4, and 27.0.1 contain a patch for this issue. As a workaround, disable app files_external. This also makes the external storage inaccessible but retains the configurations until a patched version has been deployed.",
        "URL": "https://github.com/nextcloud/server/pull/39323",
        "Commit SHA": "a82291f17997e470c84c496731e66e3f3b13c6a3",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-39963",
        "Problem_Type": "NVD-CWE-noinfo",
        "Description": "Nextcloud Server provides data storage for Nextcloud, an open source cloud platform. Starting in version 20.0.0 and prior to versions 20.0.14.15, 21.0.9.13, 22.2.10.14, 23.0.12.8, 24.0.12.5, 25.0.9, 26.0.4, and 27.0.1, a missing password confirmation allowed an attacker, after successfully stealing a session from a logged in user, to create app passwords for the victim. Nextcloud server versions 25.0.9, 26.0.4, and 27.0.1 and Nextcloud Enterprise Server versions 20.0.14.15, 21.0.9.13, 22.2.10.14, 23.0.12.9, 24.0.12.5, 25.0.9, 26.0.4, and 27.0.1 contain a patch for this issue. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/39416",
        "Commit SHA": "911450b4426b4daf19bcbb7ac4ff8c685b732447",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-45148",
        "Problem_Type": "CWE-307",
        "Description": "Nextcloud is an open source home cloud server. When Memcached is used as `memcache.distributed` the rate limiting in Nextcloud Server could be reset unexpectedly resetting the rate count earlier than intended. Users are advised to upgrade to versions 25.0.11, 26.0.6 or 27.1.0. Users unable to upgrade should change their config setting `memcache.distributed` to `\\OC\\Memcache\\Redis` and install Redis instead of Memcached.",
        "URL": "https://github.com/nextcloud/server/pull/40293",
        "Commit SHA": "165aeeb7f08ef52c9375aeff67fa00524356bf31",
        "Tag": "['Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-45151",
        "Problem_Type": "CWE-312",
        "Description": "Nextcloud server is an open source home cloud platform. Affected versions of Nextcloud stored OAuth2 tokens in plaintext which allows an attacker who has gained access to the server to potentially elevate their privilege. This issue has been addressed and users are recommended to upgrade their Nextcloud Server to version 25.0.8, 26.0.3 or 27.0.1. There are no known workarounds for this vulnerability.",
        "URL": "https://github.com/nextcloud/server/pull/38398",
        "Commit SHA": "5bf1fc6535a7f4aef8d315e576b91a283d890015",
        "Tag": "['Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-48239",
        "Problem_Type": "NVD-CWE-Other",
        "Description": "Nextcloud Server provides data storage for Nextcloud, an open source cloud platform. Starting in version 25.0.0 and prior to versions 25.0.13, 26.0.8, and 27.1.3 of Nextcloud Server and starting in version 20.0.0 and prior to versions 20.0.14.16, 21.0.9.13, 22.2.10.15, 23.0.12.12, 24.0.12.8, 25.0.13, 26.0.8, and 27.1.3 of Nextcloud Enterprise Server, a malicious user could update any personal or global external storage, making them inaccessible for everyone else as well. Nextcloud Server 25.0.13, 26.0.8, and 27.1.3 and Nextcloud Enterprise Server is upgraded to 20.0.14.16, 21.0.9.13, 22.2.10.15, 23.0.12.12, 24.0.12.8, 25.0.13, 26.0.8, and 27.1.3 contain a patch for this issue. As a workaround, disable app files_external. This workaround also makes the external storage inaccessible but retains the configurations until a patched version has been deployed.",
        "URL": "https://github.com/nextcloud/server/pull/41123",
        "Commit SHA": "18be57cb35a0b210a52e845a0c497541bb752ec2",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-48303",
        "Problem_Type": "NVD-CWE-Other",
        "Description": "Nextcloud Server provides data storage for Nextcloud, an open source cloud platform. Starting in version 25.0.0 and prior to versions 25.0.11, 26.0.6, and 27.1.0 of Nextcloud Server and Nextcloud Enterprise Server, admins can change authentication details of user configured external storage. Nextcloud Server and Nextcloud Enterprise Server versions 25.0.11, 26.0.6, and 27.1.0 contain a patch for this issue. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/39895",
        "Commit SHA": "2018c72eaa815bd3830b02ef1a86090880358aa3",
        "Tag": "['Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-48304",
        "Problem_Type": "CWE-639",
        "Description": "Nextcloud Server provides data storage for Nextcloud, an open source cloud platform. Starting in version 25.0.0 and prior to versions 25.0.11, 26.0.6, and 27.1.0 of Nextcloud Server and starting in version 22.0.0 and prior to versions 22.2.10.16, 23.0.12.11, 24.0.12.7, 25.0.11, 26.0.6, and 27.1.0 of Nextcloud Enterprise Server, an attacker could enable and disable the birthday calendar for any user on the same server. Nextcloud Server 25.0.11, 26.0.6, and 27.1.0 and Nextcloud Enterprise Server 22.2.10.16, 23.0.12.11, 24.0.12.7, 25.0.11, 26.0.6, and 27.1.0 contain patches for this issue. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/40292",
        "Commit SHA": "387cf9e7ceea6076ac53dd428c2ef83ce2c77cf0",
        "Tag": "['Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-48305",
        "Problem_Type": "CWE-312",
        "Description": "Nextcloud Server provides data storage for Nextcloud, an open source cloud platform. Starting in version 25.0.0 and prior to versions 25.0.11, 26.0.6, and 27.1.0 of Nextcloud Server and Nextcloud Enterprise Server, when the log level was set to debug, the user_ldap app logged user passwords in plaintext into the log file. If the log file was then leaked or shared in any way the users' passwords would be leaked. Nextcloud Server and Nextcloud Enterprise Server versions 25.0.11, 26.0.6, and 27.1.0 contain a patch for this issue. As a workaround, change config setting `loglevel` to `1` or higher (should always be higher than 1 in production environments).",
        "URL": "https://github.com/nextcloud/server/pull/40013",
        "Commit SHA": "dce0db8d69e24a8813cafab02bde2d01dc0e70ed",
        "Tag": "['Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-48306",
        "Problem_Type": "CWE-918",
        "Description": "Nextcloud Server provides data storage for Nextcloud, an open source cloud platform. Starting in version 25.0.0 and prior to versions 25.0.11, 26.0.6, and 27.1.0 of Nextcloud Server and starting in version 22.0.0 and prior to versions 22.2.10.16, 23.0.12.11, 24.0.12.7, 25.0.11, 26.0.6, and 27.1.0 of Nextcloud Enterprise Server, the DNS pin middleware was vulnerable to DNS rebinding allowing an attacker to perform SSRF as a final result. Nextcloud Server 25.0.11, 26.0.6, and 27.1.0 and Nextcloud Enterprise Server 22.2.10.16, 23.0.12.11, 24.0.12.7, 25.0.11, 26.0.6, and 27.1.0 contain patches for this issue. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/40234",
        "Commit SHA": "b92f5cdd3ddaa3857ae6e08b895b2553b7e07e58",
        "Tag": "['Exploit', 'Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-49791",
        "Problem_Type": "CWE-287",
        "Description": "Nextcloud Server provides data storage for Nextcloud, an open source cloud platform. In Nextcloud Server prior to versions 26.0.9 and 27.1.4; as well as Nextcloud Enterprise Server prior to versions 23.0.12.13, 24.0.12.9, 25.0.13.4, 26.0.9, and 27.1.4; when an attacker manages to get access to an active session of another user via another way, they could delete and modify workflows by sending calls directly to the API bypassing the password confirmation shown in the UI. Nextcloud Server versions 26.0.9 and 27.1.4 and Nextcloud Enterprise Server versions 23.0.12.13, 24.0.12.9, 25.0.13.4, 26.0.9, and 27.1.4 contain a patch for this issue. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/41520",
        "Commit SHA": "609932140e222e70db46f1cf9becd0b4b794df2a",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2023-49792",
        "Problem_Type": "CWE-307",
        "Description": "Nextcloud Server provides data storage for Nextcloud, an open source cloud platform. In Nextcloud Server prior to versions 26.0.9 and 27.1.4; as well as Nextcloud Enterprise Server prior to versions 23.0.12.13, 24.0.12.9, 25.0.13.4, 26.0.9, and 27.1.4; when a (reverse) proxy is configured as trusted proxy the server could be tricked into reading a wrong remote address for an attacker, allowing them executing authentication attempts than intended. Nextcloud Server versions 26.0.9 and 27.1.4 and Nextcloud Enterprise Server versions 23.0.12.13, 24.0.12.9, 25.0.13.4, 26.0.9, and 27.1.4 contain a patch for this issue. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/server/pull/41526",
        "Commit SHA": "6716b3fc0005282862666fbc4d288909e981dfa5",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/server",
        "CVE_ID": "CVE-2024-22403",
        "Problem_Type": "CWE-613",
        "Description": "Nextcloud server is a self hosted personal cloud system. In affected versions OAuth codes did not expire. When an attacker would get access to an authorization code they could authenticate at any time using the code. As of version 28.0.0 OAuth codes are invalidated after 10 minutes and will no longer be authenticated. To exploit this vulnerability an attacker would need to intercept an OAuth code from a user session. It is recommended that the Nextcloud Server is upgraded to 28.0.0. There are no known workarounds for this vulnerability.",
        "URL": "https://github.com/nextcloud/server/pull/40766",
        "Commit SHA": "b4fec29e8e403cdf6a589f5a0855b3b904c720e4",
        "Tag": "['Patch', 'Vendor Advisory']"
    }
]