[
    {
        "repo_name": "rizinorg/rizin",
        "CVE_ID": "CVE-2021-3674",
        "Problem_Type": "CWE-125",
        "Description": "A flaw was found in rizin. The create_section_from_phdr function allocates space for ELF section data by processing the headers. Crafted values in the headers can cause out of bounds reads, which can lead to memory corruption and possibly code execution through the binary object's callback function.",
        "URL": "https://github.com/rizinorg/rizin/pull/1313",
        "Commit SHA": "432e4ba85fbd992f6e926012b5bf29d97ecbc092",
        "Tag": "['Exploit', 'Patch', 'Vendor Advisory']"
    },
    {
        "repo_name": "rizinorg/rizin",
        "CVE_ID": "CVE-2022-34612",
        "Problem_Type": "CWE-190",
        "Description": "Rizin v0.4.0 and below was discovered to contain an integer overflow via the function get_long_object(). This vulnerability allows attackers to cause a Denial of Service (DoS) via a crafted binary.",
        "URL": "https://github.com/rizinorg/rizin/pull/2739",
        "Commit SHA": "e645e5827327d945307ddfde4f617ae4c36561fd",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "rizinorg/rizin",
        "CVE_ID": "CVE-2023-27590",
        "Problem_Type": "CWE-120",
        "Description": "Rizin is a UNIX-like reverse engineering framework and command-line toolset. In version 0.5.1 and prior, converting a GDB registers profile file into a Rizin register profile can result in a stack-based buffer overflow when the `name`, `type`, or `groups` fields have longer values than expected. Users opening untrusted GDB registers files (e.g. with the `drpg` or `arpg` commands) are affected by this flaw. Commit d6196703d89c84467b600ba2692534579dc25ed4 contains a patch for this issue. As a workaround, review the GDB register profiles before loading them with `drpg`/`arpg` commands.",
        "URL": "https://github.com/rizinorg/rizin/pull/3422",
        "Commit SHA": "d6196703d89c84467b600ba2692534579dc25ed4",
        "Tag": "['Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "rizinorg/rizin",
        "CVE_ID": "CVE-2023-40022",
        "Problem_Type": "CWE-190",
        "Description": "Rizin is a UNIX-like reverse engineering framework and command-line toolset. Versions 0.6.0 and prior are vulnerable to integer overflow in `consume_count` of `src/gnu_v2/cplus-dem.c`. The overflow check is valid logic but, is missing the modulus if the block once compiled. The compiler sees this block as unreachable code since the prior statement is multiplication by 10 and fails to consider overflow assuming the count will always be a multiple of 10. Rizin version 0.6.1 contains a fix for the issue. A temporary workaround would be disabling C++ demangling using the configuration option `bin.demangle=false`.",
        "URL": "https://github.com/rizinorg/rizin/pull/3753",
        "Commit SHA": "a4ec3563ca1395793360945440699768cda6ca97",
        "Tag": "['Patch']"
    }
]