[
    {
        "repo_name": "traefik/traefik",
        "CVE_ID": "CVE-2021-27375",
        "Problem_Type": "CWE-1021",
        "Description": "Traefik before 2.4.5 allows the loading of IFRAME elements from other domains.",
        "URL": "https://github.com/traefik/traefik/pull/7904",
        "Commit SHA": "bae28c5f5717ea3a80423f107fefe6948c14b7cd",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "traefik/traefik",
        "CVE_ID": "CVE-2021-32813",
        "Problem_Type": "CWE-913",
        "Description": "Traefik is an HTTP reverse proxy and load balancer. Prior to version 2.4.13, there exists a potential header vulnerability in Traefik's handling of the Connection header. Active exploitation of this issue is unlikely, as it requires that a removed header would lead to a privilege escalation, however, the Traefik team has addressed this issue to prevent any potential abuse. If one has a chain of Traefik middlewares, and one of them sets a request header, then sending a request with a certain Connection header will cause it to be removed before the request is sent. In this case, the backend does not see the request header. A patch is available in version 2.4.13. There are no known workarounds aside from upgrading.",
        "URL": "https://github.com/traefik/traefik/pull/8319/commits/cbaf86a93014a969b8accf39301932c17d0d73f9",
        "Commit SHA": "b386964abcd3322e9e975a63c8c8e774b9edadcf",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "traefik/traefik",
        "CVE_ID": "CVE-2022-23469",
        "Problem_Type": "CWE-532",
        "Description": "Traefik is an open source HTTP reverse proxy and load balancer. Versions prior to 2.9.6 are subject to a potential vulnerability in Traefik displaying the Authorization header in its debug logs. In certain cases, if the log level is set to DEBUG, credentials provided using the Authorization header are displayed in the debug logs. Attackers must have access to a users logging system in order for credentials to be stolen. This issue has been addressed in version 2.9.6. Users are advised to upgrade. Users unable to upgrade may set the log level to `INFO`, `WARN`, or `ERROR`.",
        "URL": "https://github.com/traefik/traefik/pull/9574",
        "Commit SHA": "778188ed34e886b55d1d5c3c669fce4cc49795ef",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "traefik/traefik",
        "CVE_ID": "CVE-2022-23632",
        "Problem_Type": "CWE-295",
        "Description": "Traefik is an HTTP reverse proxy and load balancer. Prior to version 2.6.1, Traefik skips the router transport layer security (TLS) configuration when the host header is a fully qualified domain name (FQDN). For a request, the TLS configuration choice can be different than the router choice, which implies the use of a wrong TLS configuration. When sending a request using FQDN handled by a router configured with a dedicated TLS configuration, the TLS configuration falls back to the default configuration that might not correspond to the configured one. If the CNAME flattening is enabled, the selected TLS configuration is the SNI one and the routing uses the CNAME value, so this can skip the expected TLS configuration. Version 2.6.1 contains a patch for this issue. As a workaround, one may add the FDQN to the host rule. However, there is no workaround if the CNAME flattening is enabled.",
        "URL": "https://github.com/traefik/traefik/pull/8764",
        "Commit SHA": "0c83ee736ca4aa93bba2d4cce4c00fd247785915",
        "Tag": "['Issue Tracking', 'Patch', 'Third Party Advisory']"
    }
]