[
    {
        "repo_name": "ansible/ansible",
        "CVE_ID": "CVE-2018-16859",
        "Problem_Type": "CWE-532",
        "Description": "Execution of Ansible playbooks on Windows platforms with PowerShell ScriptBlock logging and Module logging enabled can allow for 'become' passwords to appear in EventLogs in plaintext. A local user with administrator privileges on the machine can view these logs and discover the plaintext password. Ansible Engine 2.8 and older are believed to be vulnerable.",
        "URL": "https://github.com/ansible/ansible/pull/49142",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "ansible/ansible",
        "CVE_ID": "CVE-2018-16876",
        "Problem_Type": "CWE-200",
        "Description": "ansible before versions 2.5.14, 2.6.11, 2.7.5 is vulnerable to a information disclosure flaw in vvv+ mode with no_log on that can lead to leakage of sensible data.",
        "URL": "https://github.com/ansible/ansible/pull/49569",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "ansible/ansible",
        "CVE_ID": "CVE-2019-10156",
        "Problem_Type": "CWE-200",
        "Description": "A flaw was discovered in the way Ansible templating was implemented in versions before 2.6.18, 2.7.12 and 2.8.2, causing the possibility of information disclosure through unexpected variable substitution. By taking advantage of unintended variable substitution the content of any variable may be disclosed.",
        "URL": "https://github.com/ansible/ansible/pull/57188",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "ansible/ansible",
        "CVE_ID": "CVE-2019-14846",
        "Problem_Type": "CWE-532",
        "Description": "In Ansible, all Ansible Engine versions up to ansible-engine 2.8.5, ansible-engine 2.7.13, ansible-engine 2.6.19, were logging at the DEBUG level which lead to a disclosure of credentials if a plugin used a library that logged credentials at the DEBUG level. This flaw does not affect Ansible modules, as those are executed in a separate process.",
        "URL": "https://github.com/ansible/ansible/pull/63366",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "ansible/ansible",
        "CVE_ID": "CVE-2019-14864",
        "Problem_Type": "CWE-532",
        "Description": "Ansible, versions 2.9.x before 2.9.1, 2.8.x before 2.8.7 and Ansible versions 2.7.x before 2.7.15, is not respecting the flag no_log set it to True when Sumologic and Splunk callback plugins are used send tasks results events to collectors. This would discloses and collects any sensitive data.",
        "URL": "https://github.com/ansible/ansible/pull/63527",
        "Tag": "['Patch', 'Vendor Advisory']"
    },
    {
        "repo_name": "ansible/ansible",
        "CVE_ID": "CVE-2019-14904",
        "Problem_Type": "CWE-20",
        "Description": "A flaw was found in the solaris_zone module from the Ansible Community modules. When setting the name for the zone on the Solaris host, the zone name is checked by listing the process with the 'ps' bare command on the remote machine. An attacker could take advantage of this flaw by crafting the name of the zone and executing arbitrary commands in the remote host. Ansible Engine 2.7.15, 2.8.7, and 2.9.2 as well as previous versions are affected.",
        "URL": "https://github.com/ansible/ansible/pull/65686",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "ansible/ansible",
        "CVE_ID": "CVE-2019-3828",
        "Problem_Type": "CWE-22",
        "Description": "Ansible fetch module before versions 2.5.15, 2.6.14, 2.7.8 has a path traversal vulnerability which allows copying and overwriting files outside of the specified destination in the local ansible controller host, by not restricting an absolute path.",
        "URL": "https://github.com/ansible/ansible/pull/52133",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "ansible/ansible",
        "CVE_ID": "CVE-2020-10685",
        "Problem_Type": "CWE-459",
        "Description": "A flaw was found in Ansible Engine affecting Ansible Engine versions 2.7.x before 2.7.17 and 2.8.x before 2.8.11 and 2.9.x before 2.9.7 as well as Ansible Tower before and including versions 3.4.5 and 3.5.5 and 3.6.3 when using modules which decrypts vault files such as assemble, script, unarchive, win_copy, aws_s3 or copy modules. The temporary directory is created in /tmp leaves the s ts unencrypted. On Operating Systems which /tmp is not a tmpfs but part of the root partition, the directory is only cleared on boot and the decryp emains when the host is switched off. The system will be vulnerable when the system is not running. So decrypted data must be cleared as soon as possible and the data which normally is encrypted ble.",
        "URL": "https://github.com/ansible/ansible/pull/68433",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "ansible/ansible",
        "CVE_ID": "CVE-2020-10691",
        "Problem_Type": "CWE-22",
        "Description": "An archive traversal flaw was found in all ansible-engine versions 2.9.x prior to 2.9.7, when running ansible-galaxy collection install. When extracting a collection .tar.gz file, the directory is created without sanitizing the filename. An attacker could take advantage to overwrite any file within the system.",
        "URL": "https://github.com/ansible/ansible/pull/68596",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "ansible/ansible",
        "CVE_ID": "CVE-2020-14332",
        "Problem_Type": "CWE-117",
        "Description": "A flaw was found in the Ansible Engine when using module_args. Tasks executed with check mode (--check-mode) do not properly neutralize sensitive data exposed in the event data. This flaw allows unauthorized users to read this data. The highest threat from this vulnerability is to confidentiality.",
        "URL": "https://github.com/ansible/ansible/pull/71033",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "ansible/ansible",
        "CVE_ID": "CVE-2020-1746",
        "Problem_Type": "CWE-200",
        "Description": "A flaw was found in the Ansible Engine affecting Ansible Engine versions 2.7.x before 2.7.17 and 2.8.x before 2.8.11 and 2.9.x before 2.9.7 as well as Ansible Tower before and including versions 3.4.5 and 3.5.5 and 3.6.3 when the ldap_attr and ldap_entry community modules are used. The issue discloses the LDAP bind password to stdout or a log file if a playbook task is written using the bind_pw in the parameters field. The highest threat from this vulnerability is data confidentiality.",
        "URL": "https://github.com/ansible/ansible/pull/67866",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "ansible/ansible",
        "CVE_ID": "CVE-2021-20228",
        "Problem_Type": "CWE-200",
        "Description": "A flaw was found in the Ansible Engine 2.9.18, where sensitive info is not masked by default and is not protected by the no_log feature when using the sub-option feature of the basic.py module. This flaw allows an attacker to obtain sensitive information. The highest threat from this vulnerability is to confidentiality.",
        "URL": "https://github.com/ansible/ansible/pull/73487",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "ansible/ansible",
        "CVE_ID": "CVE-2024-0690",
        "Problem_Type": "CWE-116",
        "Description": "An information disclosure flaw was found in ansible-core due to a failure to respect the ANSIBLE_NO_LOG configuration in some scenarios. Information is still included in the output in certain tasks, such as loop items. Depending on the task, this issue may include sensitive information, such as decrypted secret values.",
        "URL": "https://github.com/ansible/ansible/pull/82565",
        "Tag": "['Issue Tracking', 'Patch']"
    }
]