[
    {
        "repo_name": "directus/directus",
        "CVE_ID": "CVE-2022-24814",
        "Problem_Type": "CWE-79",
        "Description": "Directus is a real-time API and App dashboard for managing SQL database content. Prior to version 9.7.0, unauthorized JavaScript (JS) can be executed by inserting an iframe into the rich text html interface that links to a file uploaded HTML file that loads another uploaded JS file in its script tag. This satisfies the regular content security policy header, which in turn allows the file to run any arbitrary JS. This issue was resolved in version 9.7.0. As a workaround, disable the live embed in the what-you-see-is-what-you-get by adding `{ \"media_live_embeds\": false }` to the _Options Overrides_ option of the Rich Text HTML interface.",
        "URL": "https://github.com/directus/directus/pull/12020",
        "Tag": "['Issue Tracking', 'Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "directus/directus",
        "CVE_ID": "CVE-2022-26969",
        "Problem_Type": "NVD-CWE-noinfo",
        "Description": "In Directus before 9.7.0, the default settings of CORS_ORIGIN and CORS_ENABLED are true.",
        "URL": "https://github.com/directus/directus/pull/12022",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "directus/directus",
        "CVE_ID": "CVE-2023-27474",
        "Problem_Type": "CWE-79",
        "Description": "Directus is a real-time API and App dashboard for managing SQL database content. Instances relying on an allow-listed reset URL are vulnerable to an HTML injection attack through the use of query parameters in the reset URL. An attacker could exploit this to email users urls to the servers domain but which may contain malicious code. The problem has been resolved and released under version 9.23.0. People relying on a custom password reset URL should upgrade to 9.23.0 or later, or remove the custom reset url from the configured allow list. Users are advised to upgrade. Users unable to upgrade may disable the custom reset URL allow list as a workaround.",
        "URL": "https://github.com/directus/directus/pull/17120",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "directus/directus",
        "CVE_ID": "CVE-2023-27481",
        "Problem_Type": "CWE-200",
        "Description": "Directus is a real-time API and App dashboard for managing SQL database content. In versions prior to 9.16.0 users with read access to the `password` field in `directus_users` can extract the argon2 password hashes by brute forcing the export functionality combined with a `_starts_with` filter. This allows the user to enumerate the password hashes. Accounts cannot be taken over unless the hashes can be reversed which is unlikely with current hardware. This problem has been patched by preventing any hashed/concealed field to be filtered against with the `_starts_with` or other string operator in version 9.16.0. Users are advised to upgrade. Users unable to upgrade may mitigate this issue by ensuring that no user has `read` access to the `password` field in `directus_users`.",
        "URL": "https://github.com/directus/directus/pull/15010",
        "Tag": "['Patch', 'Vendor Advisory']"
    },
    {
        "repo_name": "directus/directus",
        "CVE_ID": "CVE-2023-27481",
        "Problem_Type": "CWE-200",
        "Description": "Directus is a real-time API and App dashboard for managing SQL database content. In versions prior to 9.16.0 users with read access to the `password` field in `directus_users` can extract the argon2 password hashes by brute forcing the export functionality combined with a `_starts_with` filter. This allows the user to enumerate the password hashes. Accounts cannot be taken over unless the hashes can be reversed which is unlikely with current hardware. This problem has been patched by preventing any hashed/concealed field to be filtered against with the `_starts_with` or other string operator in version 9.16.0. Users are advised to upgrade. Users unable to upgrade may mitigate this issue by ensuring that no user has `read` access to the `password` field in `directus_users`.",
        "URL": "https://github.com/directus/directus/pull/14829",
        "Tag": "['Patch', 'Vendor Advisory']"
    },
    {
        "repo_name": "directus/directus",
        "CVE_ID": "CVE-2023-38503",
        "Problem_Type": "CWE-863",
        "Description": "Directus is a real-time API and App dashboard for managing SQL database content. Starting in version 10.3.0 and prior to version 10.5.0, the permission filters (i.e. `user_created IS $CURRENT_USER`) are not properly checked when using GraphQL subscription resulting in unauthorized users getting event on their subscription which they should not be receiving according to the permissions. This can be any collection but out-of-the box the `directus_users` collection is configured with such a permissions filter allowing you to get updates for other users when changes happen. Version 10.5.0 contains a patch. As a workaround, disable GraphQL subscriptions.",
        "URL": "https://github.com/directus/directus/pull/19155",
        "Tag": "['Patch']"
    }
]