[
    {
        "repo_name": "ethereum/go-ethereum",
        "CVE_ID": "CVE-2018-12018",
        "Problem_Type": "CWE-129",
        "Description": "The GetBlockHeadersMsg handler in the LES protocol implementation in Go Ethereum (aka geth) before 1.8.11 may lead to an access violation because of an integer signedness error for the array index, which allows attackers to launch a Denial of Service attack by sending a packet with a -1 query.Skip value. The vulnerable remote node would be crashed by such an attack immediately, aka the EPoD (Ethereum Packet of Death) issue.",
        "URL": "https://github.com/ethereum/go-ethereum/pull/16891",
        "Tag": "['Issue Tracking', 'Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "ethereum/go-ethereum",
        "CVE_ID": "CVE-2020-26240",
        "Problem_Type": "CWE-682",
        "Description": "Go Ethereum, or \"Geth\", is the official Golang implementation of the Ethereum protocol. An ethash mining DAG generation flaw in Geth before version 1.9.24 could cause miners to erroneously calculate PoW in an upcoming epoch (estimated early January, 2021). This happened on the ETC chain on 2020-11-06. This issue is relevant only for miners, non-mining nodes are unaffected. This issue is fixed as of 1.9.24",
        "URL": "https://github.com/ethereum/go-ethereum/pull/21793",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "ethereum/go-ethereum",
        "CVE_ID": "CVE-2020-26264",
        "Problem_Type": "CWE-400",
        "Description": "Go Ethereum, or \"Geth\", is the official Golang implementation of the Ethereum protocol. In Geth before version 1.9.25 a denial-of-service vulnerability can make a LES server crash via malicious GetProofsV2 request from a connected LES client. This vulnerability only concerns users explicitly enabling les server; disabling les prevents the exploit. The vulnerability was patched in version 1.9.25.",
        "URL": "https://github.com/ethereum/go-ethereum/pull/21896",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "ethereum/go-ethereum",
        "CVE_ID": "CVE-2021-41173",
        "Problem_Type": "NVD-CWE-noinfo",
        "Description": "Go Ethereum is the official Golang implementation of the Ethereum protocol. Prior to version 1.10.9, a vulnerable node is susceptible to crash when processing a maliciously crafted message from a peer. Version v1.10.9 contains patches to the vulnerability. There are no known workarounds aside from upgrading.",
        "URL": "https://github.com/ethereum/go-ethereum/pull/23801",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "ethereum/go-ethereum",
        "CVE_ID": "CVE-2022-29177",
        "Problem_Type": "NVD-CWE-noinfo",
        "Description": "Go Ethereum is the official Golang implementation of the Ethereum protocol. Prior to version 1.10.17, a vulnerable node, if configured to use high verbosity logging, can be made to crash when handling specially crafted p2p messages sent from an attacker node. Version 1.10.17 contains a patch that addresses the problem. As a workaround, setting loglevel to default level (`INFO`) makes the node not vulnerable to this attack.",
        "URL": "https://github.com/ethereum/go-ethereum/pull/24507",
        "Tag": "['Patch', 'Third Party Advisory']"
    }
]