[
    {
        "repo_name": "Finastra/finastra-nodejs-libs",
        "CVE_ID": "CVE-2022-31069",
        "Problem_Type": "CWE-200",
        "Description": "NestJS Proxy is a NestJS module to decorate and proxy calls. Prior to version 0.7.0, the nestjs-proxy library did not have a way to control when Authorization headers should should be forwarded for specific backend services configured by the application developer. This could have resulted in sensitive information such as OAuth bearer access tokens being inadvertently exposed to such services that should not see them. A new feature has been introduced in the patched version of nestjs-proxy that allows application developers to opt out of forwarding the Authorization headers on a per service basis using the `forwardToken` config setting. Developers are advised to review the README for this library on Github or NPM for further details on how this configuration can be applied. This issue has been fixed in version 0.7.0 of `@finastra/nestjs-proxy`. Users of `@ffdc/nestjs-proxy` are advised that this package has been deprecated and is no longer being maintained or receiving updates. Such users should update their package.json file to use `@finastra/nestjs-proxy` instead.",
        "URL": "https://github.com/Finastra/finastra-nodejs-libs/pull/231",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "ebbe4f7bed6f15c2aac3d75a7bc70220e38db6fe"
    },
    {
        "repo_name": "Finastra/finastra-nodejs-libs",
        "CVE_ID": "CVE-2022-31070",
        "Problem_Type": "CWE-200",
        "Description": "NestJS Proxy is a NestJS module to decorate and proxy calls. Prior to version 0.7.0, the nestjs-proxy library did not have a way to block sensitive cookies (e.g. session cookies) from being forwarded to backend services configured by the application developer. This could have led to sensitive cookies being inadvertently exposed to such services that should not see them. The patched version now blocks cookies from being forwarded by default. However developers can configure an allow-list of cookie names by using the `allowedCookies` config setting. This issue has been fixed in version 0.7.0 of `@finastra/nestjs-proxy`. Users of `@ffdc/nestjs-proxy` are advised that this package has been deprecated and is no longer being maintained or receiving updates. Such users should update their package.json file to use `@finastra/nestjs-proxy` instead.",
        "URL": "https://github.com/Finastra/finastra-nodejs-libs/pull/232",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "90a7157a04297fce5050b9ba33e6d4653268b4a3"
    }
]