[
    {
        "repo_name": "moby/hyperkit",
        "CVE_ID": "CVE-2021-32843",
        "Problem_Type": "CWE-476",
        "Description": "HyperKit is a toolkit for embedding hypervisor capabilities in an application. In versions 0.20210107 and prior of HyperKit, `virtio.c` has is a call to `vc_cfgread` that does not check for null which when called makes the host crash. This issue may lead to a guest crashing the host causing a denial of service. This issue is fixed in commit df0e46c7dbfd81a957d85e449ba41b52f6f7beb4.",
        "URL": "https://github.com/moby/hyperkit/pull/313",
        "Tag": "['Patch']",
        "fix_commit_hash": "acbc2d10593dfa86f490e799a7ee865db6da899f"
    },
    {
        "repo_name": "moby/hyperkit",
        "CVE_ID": "CVE-2021-32844",
        "Problem_Type": "CWE-476",
        "Description": "HyperKit is a toolkit for embedding hypervisor capabilities in an application. In versions 0.20210107 and prior of HyperKit, ` vi_pci_write` has is a call to `vc_cfgwrite` that does not check for null which when called makes the host crash. This issue may lead to a guest crashing the host causing a denial of service. This issue is fixed in commit 451558fe8aaa8b24e02e34106e3bb9fe41d7ad13.",
        "URL": "https://github.com/moby/hyperkit/pull/313",
        "Tag": "['Patch']",
        "fix_commit_hash": "acbc2d10593dfa86f490e799a7ee865db6da899f"
    },
    {
        "repo_name": "moby/hyperkit",
        "CVE_ID": "CVE-2021-32845",
        "Problem_Type": "CWE-252",
        "Description": "HyperKit is a toolkit for embedding hypervisor capabilities in an application. In versions 0.20210107 and prior of HyperKit, the implementation of `qnotify` at `pci_vtrnd_notify` fails to check the return value of `vq_getchain`. This leads to `struct iovec iov;` being uninitialized and used to read memory in `len = (int) read(sc->vrsc_fd, iov.iov_base, iov.iov_len);` when an attacker is able to make `vq_getchain` fail. This issue may lead to a guest crashing the host causing a denial of service and, under certain circumstance, memory corruption. This issue is fixed in commit 41272a980197917df8e58ff90642d14dec8fe948.",
        "URL": "https://github.com/moby/hyperkit/pull/313",
        "Tag": "['Patch']",
        "fix_commit_hash": "acbc2d10593dfa86f490e799a7ee865db6da899f"
    },
    {
        "repo_name": "moby/hyperkit",
        "CVE_ID": "CVE-2021-32846",
        "Problem_Type": "CWE-754",
        "Description": "HyperKit is a toolkit for embedding hypervisor capabilities in an application. In versions 0.20210107, function `pci_vtsock_proc_tx` in `virtio-sock` can lead to to uninitialized memory use. In this situation, there is a check for the return value to be less or equal to `VTSOCK_MAXSEGS`, but that check is not sufficient because the function can return `-1` if it finds an error it cannot recover from. Moreover, the negative return value will be used by `iovec_pull` in a while condition that can further lead to more corruption because the function is not designed to handle a negative `iov_len`. This issue may lead to a guest crashing the host causing a denial of service and, under certain circumstance, memory corruption. This issue is fixed in commit af5eba2360a7351c08dfd9767d9be863a50ebaba.",
        "URL": "https://github.com/moby/hyperkit/pull/313",
        "Tag": "['Patch']",
        "fix_commit_hash": "acbc2d10593dfa86f490e799a7ee865db6da899f"
    }
]