[
    {
        "repo_name": "nextcloud/calendar",
        "CVE_ID": "CVE-2022-24838",
        "Problem_Type": "CWE-74",
        "Description": "Nextcloud Calendar is a calendar application for the nextcloud framework. SMTP Command Injection in Appointment Emails via Newlines: as newlines and special characters are not sanitized in the email value in the JSON request, a malicious attacker can inject newlines to break out of the `RCPT TO:<BOOKING USER'S EMAIL> ` SMTP command and begin injecting arbitrary SMTP commands. It is recommended that Calendar is upgraded to 3.2.2. There are no workaround available.",
        "URL": "https://github.com/nextcloud/calendar/pull/4073",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "09428f525bfaf2709c314c24cf2774ffc52c9661"
    },
    {
        "repo_name": "nextcloud/calendar",
        "CVE_ID": "CVE-2023-33183",
        "Problem_Type": "NVD-CWE-noinfo",
        "Description": "Calendar app for Nextcloud easily sync events from various devices with your Nextcloud. Some internal paths of the website are disclosed when the SMTP server is unavailable. It is recommended that the Calendar app is updated to 3.5.5 or 4.2.3\n\n",
        "URL": "https://github.com/nextcloud/calendar/pull/4938",
        "Tag": "['Patch']",
        "fix_commit_hash": "b6230de225d8cec6e26d2814834c869d4484945b"
    },
    {
        "repo_name": "nextcloud/calendar",
        "CVE_ID": "CVE-2023-45150",
        "Problem_Type": "CWE-354",
        "Description": "Nextcloud calendar is a calendar app for the Nextcloud server platform. Due to missing precondition checks the server was trying to validate strings of any length as email addresses even when megabytes of data were provided, eventually making the server busy and unresponsive. It is recommended that the Nextcloud Calendar app is upgraded to 4.4.4. The only workaround for users unable to upgrade is to disable the calendar app.",
        "URL": "https://github.com/nextcloud/calendar/pull/5358",
        "Tag": "['Patch']",
        "fix_commit_hash": "afb60be7d579fdaab9fac66a1228f7c16ea74a0e"
    },
    {
        "repo_name": "nextcloud/calendar",
        "CVE_ID": "CVE-2023-48308",
        "Problem_Type": "CWE-212",
        "Description": "Nextcloud/Cloud is a calendar app for Nextcloud. An attacker can gain access to stacktrace and internal paths of the server when generating an exception while editing a calendar appointment. It is recommended that the Nextcloud Calendar app is upgraded to 4.5.3\n",
        "URL": "https://github.com/nextcloud/calendar/pull/5553",
        "Tag": "['Patch', 'Vendor Advisory']",
        "fix_commit_hash": "438295522473e0df6944907191d83915b698e0cc"
    }
]