[
    {
        "repo_name": "nextcloud/desktop",
        "CVE_ID": "CVE-2021-22879",
        "Problem_Type": "CWE-74",
        "Description": "Nextcloud Desktop Client prior to 3.1.3 is vulnerable to resource injection by way of missing validation of URLs, allowing a malicious server to execute remote commands. User interaction is needed for exploitation.",
        "URL": "https://github.com/nextcloud/desktop/pull/2906",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "7f92d8dccb258b15538cd5ef8d2679012e7202de"
    },
    {
        "repo_name": "nextcloud/desktop",
        "CVE_ID": "CVE-2021-22895",
        "Problem_Type": "CWE-295",
        "Description": "Nextcloud Desktop Client before 3.3.1 is vulnerable to improper certificate validation due to lack of SSL certificate verification when using the \"Register with a Provider\" flow.",
        "URL": "https://github.com/nextcloud/desktop/pull/2926",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "b1ddd0e491b2af0ed040e658d8bcde2a7a61c9fc"
    },
    {
        "repo_name": "nextcloud/desktop",
        "CVE_ID": "CVE-2021-32728",
        "Problem_Type": "CWE-295",
        "Description": "The Nextcloud Desktop Client is a tool to synchronize files from Nextcloud Server with a computer. Clients using the Nextcloud end-to-end encryption feature download the public and private key via an API endpoint. In versions prior to 3.3.0, the Nextcloud Desktop client fails to check if a private key belongs to previously downloaded public certificate. If the Nextcloud instance serves a malicious public key, the data would be encrypted for this key and thus could be accessible to a malicious actor. This issue is fixed in Nextcloud Desktop Client version 3.3.0. There are no known workarounds aside from upgrading.",
        "URL": "https://github.com/nextcloud/desktop/pull/3338",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "ba5f51741729e6217a6cfaa62420f9df79bcfac2"
    },
    {
        "repo_name": "nextcloud/desktop",
        "CVE_ID": "CVE-2021-37617",
        "Problem_Type": "CWE-427",
        "Description": "The Nextcloud Desktop Client is a tool to synchronize files from Nextcloud Server with a computer. The Nextcloud Desktop Client invokes its uninstaller script when being installed to make sure there are no remnants of previous installations. In versions 3.0.3 through 3.2.4, the Client searches the `Uninstall.exe` file in a folder that can be written by regular users. This could lead to a case where a malicious user creates a malicious `Uninstall.exe`, which would be executed with administrative privileges on the Nextcloud Desktop Client installation. This issue is fixed in Nextcloud Desktop Client version 3.3.0. As a workaround, do not allow untrusted users to create content in the `C:\\` system folder and verify that there is no malicious `C:\\Uninstall.exe` file on the system.",
        "URL": "https://github.com/nextcloud/desktop/pull/3497",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "80267adb3a8076d91d5bea6d7544d8b759cc68b2"
    },
    {
        "repo_name": "nextcloud/desktop",
        "CVE_ID": "CVE-2022-39331",
        "Problem_Type": "CWE-79",
        "Description": "Nexcloud desktop is the Desktop sync client for Nextcloud. An attacker can inject arbitrary HyperText Markup Language into the Desktop Client application in the notifications. It is recommended that the Nextcloud Desktop client is upgraded to 3.6.1. There are no known workarounds for this issue.",
        "URL": "https://github.com/nextcloud/desktop/pull/4944",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "7397d990cc444dbe0ac05f59222b2364480b1e26"
    },
    {
        "repo_name": "nextcloud/desktop",
        "CVE_ID": "CVE-2022-39332",
        "Problem_Type": "CWE-79",
        "Description": "Nexcloud desktop is the Desktop sync client for Nextcloud. An attacker can inject arbitrary HyperText Markup Language into the Desktop Client application via user status and information. It is recommended that the Nextcloud Desktop client is upgraded to 3.6.1. There are no known workarounds for this issue.",
        "URL": "https://github.com/nextcloud/desktop/pull/4972",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "38bc1e271818e53822d5a089b88b0447473973c8"
    },
    {
        "repo_name": "nextcloud/desktop",
        "CVE_ID": "CVE-2022-39333",
        "Problem_Type": "CWE-79",
        "Description": "Nexcloud desktop is the Desktop sync client for Nextcloud. An attacker can inject arbitrary HyperText Markup Language into the Desktop Client application. It is recommended that the Nextcloud Desktop client is upgraded to 3.6.1. There are no known workarounds for this issue.",
        "URL": "https://github.com/nextcloud/desktop/pull/4972",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "38bc1e271818e53822d5a089b88b0447473973c8"
    },
    {
        "repo_name": "nextcloud/desktop",
        "CVE_ID": "CVE-2022-39334",
        "Problem_Type": "CWE-295",
        "Description": "Nextcloud also ships a CLI utility called nextcloudcmd which is sometimes used for automated scripting and headless servers. Versions of nextcloudcmd prior to 3.6.1 would incorrectly trust invalid TLS certificates, which may enable a Man-in-the-middle attack that exposes sensitive data or credentials to a network attacker. This affects the CLI only. It does not affect the standard GUI desktop Nextcloud clients, and it does not affect the Nextcloud server.",
        "URL": "https://github.com/nextcloud/desktop/pull/5022",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "42f6a63361e3dc31dce32fd50ac08a71333961bc"
    },
    {
        "repo_name": "nextcloud/desktop",
        "CVE_ID": "CVE-2022-41882",
        "Problem_Type": "CWE-94",
        "Description": "The Nextcloud Desktop Client is a tool to synchronize files from Nextcloud Server with your computer. In version 3.6.0, if a user received a malicious file share and has it synced locally or the virtual filesystem enabled and clicked a nc://open/ link it will open the default editor for the file type of the shared file, which on Windows can also sometimes mean that a file depending on the type, e.g. \"vbs\", is being executed. It is recommended that the Nextcloud Desktop client is upgraded to version 3.6.1. As a workaround, users can block the Nextcloud Desktop client 3.6.0 by setting the `minimum.supported.desktop.version` system config to `3.6.1` on the server, so new files designed to use this attack vector are not downloaded anymore. Already existing files can still be used. Another workaround would be to enforce shares to be accepted by setting the `sharing.force_share_accept` system config to `true` on the server, so new files designed to use this attack vector are not downloaded anymore. Already existing shares can still be abused.",
        "URL": "https://github.com/nextcloud/desktop/pull/5039",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "5baa254f3dfe66367d7d08c7fe4e2d257433a9a2"
    },
    {
        "repo_name": "nextcloud/desktop",
        "CVE_ID": "CVE-2023-22472",
        "Problem_Type": "CWE-352",
        "Description": "Deck is a kanban style organization tool aimed at personal planning and project organization for teams integrated with Nextcloud. It is possible to make a user send any POST request with an arbitrary body given they click on a malicious deep link on a Windows computer. (e.g. in an email, chat link, etc). There are currently no known workarounds. It is recommended that the Nextcloud Desktop client is upgraded to 3.6.2.\n",
        "URL": "https://github.com/nextcloud/desktop/pull/5106",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "6fa2e60bba99f9be7c57eefc447252f7199a5a25"
    },
    {
        "repo_name": "nextcloud/desktop",
        "CVE_ID": "CVE-2023-23942",
        "Problem_Type": "CWE-79",
        "Description": "The Nextcloud Desktop Client is a tool to synchronize files from a Nextcloud Server with your computer. Versions prior to 3.6.3 are missing sanitisation on qml labels which are used for basic HTML elements such as `strong`, `em` and `head` lines in the UI of the desktop client. The lack of sanitisation may allow for javascript injection. It is recommended that the Nextcloud Desktop Client is upgraded to 3.6.3. There are no known workarounds for this issue.",
        "URL": "https://github.com/nextcloud/desktop/pull/5233",
        "Tag": "['Patch']",
        "fix_commit_hash": "98e6ab2c646f5766ce08a841f3bb6e7f2516fb1f"
    },
    {
        "repo_name": "nextcloud/desktop",
        "CVE_ID": "CVE-2023-28997",
        "Problem_Type": "CWE-323",
        "Description": "The Nextcloud Desktop Client is a tool to synchronize files from Nextcloud Server. Starting with version 3.0.0 and prior to version 3.6.5, a malicious server administrator can recover and modify the contents of end-to-end encrypted files. Users should upgrade the Nextcloud Desktop client to 3.6.5 to receive a patch. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/desktop/pull/5324",
        "Tag": "['Patch']",
        "fix_commit_hash": "593377a4cbc696a0c21db85d78b514da2290e0eb"
    },
    {
        "repo_name": "nextcloud/desktop",
        "CVE_ID": "CVE-2023-28998",
        "Problem_Type": "CWE-325",
        "Description": "The Nextcloud Desktop Client is a tool to synchronize files from Nextcloud Server. Starting with version 3.0.0 and prior to version 3.6.5, a malicious server administrator can gain full access to an end-to-end encrypted folder. They can decrypt files, recover the folder structure, and add new files.? Users should upgrade the Nextcloud Desktop client to 3.6.5 to receive a patch. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/desktop/pull/5323",
        "Tag": "['Patch', 'Vendor Advisory']",
        "fix_commit_hash": "14072703c4f7e619a7fc6f92b05143c9333df6e8"
    },
    {
        "repo_name": "nextcloud/desktop",
        "CVE_ID": "CVE-2023-28999",
        "Problem_Type": "CWE-311",
        "Description": "Nextcloud is an open-source productivity platform. In Nextcloud Desktop client 3.0.0 until 3.8.0, Nextcloud Android app 3.13.0 until 3.25.0, and Nextcloud iOS app 3.0.5 until 4.8.0, a malicious server administrator can gain full access to an end-to-end encrypted folder. They can decrypt files, recover the folder structure and add new files.? This issue is fixed in Nextcloud Desktop 3.8.0, Nextcloud Android 3.25.0, and Nextcloud iOS 4.8.0. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/desktop/pull/5560",
        "Tag": "['Patch', 'Vendor Advisory']",
        "fix_commit_hash": "086eb14b83c2475e5d47b5b36f714e018b25045f"
    },
    {
        "repo_name": "nextcloud/desktop",
        "CVE_ID": "CVE-2023-29000",
        "Problem_Type": "CWE-295",
        "Description": "The Nextcloud Desktop Client is a tool to synchronize files from Nextcloud Server. Starting with version 3.0.0 and prior to version 3.7.0, by trusting that the server will return a certificate that belongs to the keypair of the user, a malicious server could get the desktop client to encrypt files with a key known to the attacker. This issue is fixed in Nextcloud Desktop 3.7.0. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/desktop/pull/4949",
        "Tag": "['Patch']",
        "fix_commit_hash": "f1c3ceeee5726f2905a58bd0e4aade6b4ba25281"
    }
]