[
    {
        "repo_name": "nextcloud/mail",
        "CVE_ID": "CVE-2021-22896",
        "Problem_Type": "CWE-862",
        "Description": "Nextcloud Mail before 1.9.5 suffers from improper access control due to a missing permission check allowing other authenticated users to create mail aliases for other users.",
        "URL": "https://github.com/nextcloud/mail/pull/4864",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/mail",
        "CVE_ID": "CVE-2021-32707",
        "Problem_Type": "NVD-CWE-Other",
        "Description": "Nextcloud Mail is a mail app for Nextcloud. In versions prior to 1.9.6, the Nextcloud Mail application does not, by default, render images in emails to not leak the read state. The privacy filter failed to filter images with a `background-image` CSS attribute. Note that the images were still passed through the Nextcloud image proxy, and thus there was no IP leakage. The issue was patched in version 1.9.6 and 1.10.0. No workarounds are known to exist.",
        "URL": "https://github.com/nextcloud/mail/pull/5189",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/mail",
        "CVE_ID": "CVE-2021-39220",
        "Problem_Type": "CWE-20",
        "Description": "Nextcloud is an open-source, self-hosted productivity platform The Nextcloud Mail application prior to versions 1.10.4 and 1.11.0 does by default not render images in emails to not leak the read state or user IP. The privacy filter failed to filter images with a relative protocol. It is recommended that the Nextcloud Mail application is upgraded to 1.10.4 or 1.11.0. There are no known workarounds aside from upgrading.",
        "URL": "https://github.com/nextcloud/mail/pull/5470",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/mail",
        "CVE_ID": "CVE-2022-31119",
        "Problem_Type": "CWE-532",
        "Description": "Nextcloud Mail is an email application for the nextcloud personal cloud product. Affected versions of Nextcloud mail would log user passwords to disk in the event of a misconfiguration. Should an attacker gain access to the logs complete access to affected accounts would be obtainable. It is recommended that the Nextcloud Mail is upgraded to 1.12.1. Operators should inspect their logs and remove passwords which have been logged. There are no workarounds to prevent logging in the event of a misconfiguration.",
        "URL": "https://github.com/nextcloud/mail/pull/6488/commits/ab9ade57fbc1f465ffe905248f93f328d638d7e5",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/mail",
        "CVE_ID": "CVE-2022-31131",
        "Problem_Type": "CWE-639",
        "Description": "Nextcloud mail is a Mail app for the Nextcloud home server product. Versions of Nextcloud mail prior to 1.12.2 were found to be missing user account ownership checks when performing tasks related to mail attachments. Attachments may have been exposed to incorrect system users. It is recommended that the Nextcloud Mail app is upgraded to 1.12.2. There are no known workarounds for this issue. ### Workarounds No workaround available ### References * [Pull request](https://github.com/nextcloud/mail/pull/6600) * [HackerOne](https://hackerone.com/reports/1579820) ### For more information If you have any questions or comments about this advisory: * Create a post in [nextcloud/security-advisories](https://github.com/nextcloud/security-advisories/discussions) * Customers: Open a support ticket at [support.nextcloud.com](https://support.nextcloud.com)",
        "URL": "https://github.com/nextcloud/mail/pull/6600/commits/6dd2527be8d4f6788b449c8a8f5577628b990605",
        "Tag": "['Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/mail",
        "CVE_ID": "CVE-2022-31131",
        "Problem_Type": "CWE-639",
        "Description": "Nextcloud mail is a Mail app for the Nextcloud home server product. Versions of Nextcloud mail prior to 1.12.2 were found to be missing user account ownership checks when performing tasks related to mail attachments. Attachments may have been exposed to incorrect system users. It is recommended that the Nextcloud Mail app is upgraded to 1.12.2. There are no known workarounds for this issue. ### Workarounds No workaround available ### References * [Pull request](https://github.com/nextcloud/mail/pull/6600) * [HackerOne](https://hackerone.com/reports/1579820) ### For more information If you have any questions or comments about this advisory: * Create a post in [nextcloud/security-advisories](https://github.com/nextcloud/security-advisories/discussions) * Customers: Open a support ticket at [support.nextcloud.com](https://support.nextcloud.com)",
        "URL": "https://github.com/nextcloud/mail/pull/6600",
        "Tag": "['Issue Tracking', 'Patch', 'Third Party Advisory']"
    },
    {
        "repo_name": "nextcloud/mail",
        "CVE_ID": "CVE-2023-23943",
        "Problem_Type": "CWE-918",
        "Description": "Nextcloud mail is an email app for the nextcloud home server platform. In affected versions the SMTP, IMAP and Sieve host fields allowed to scan for internal services and servers reachable from within the local network of the Nextcloud Server. It is recommended that the Nextcloud Maill app is upgraded to 1.15.0 or 2.2.2. The only known workaround for this issue is to completely disable the nextcloud mail app.",
        "URL": "https://github.com/nextcloud/mail/pull/7796",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/mail",
        "CVE_ID": "CVE-2023-23944",
        "Problem_Type": "CWE-312",
        "Description": "Nextcloud mail is an email app for the nextcloud home server platform. In versions prior to 2.2.2 user's passwords were stored in cleartext in the database during the duration of OAuth2 setup procedure. Any attacker or malicious user with access to the database would have access to these user passwords until the OAuth setup has been completed. It is recommended that the Nextcloud Mail app is upgraded to 2.2.2. There are no known workarounds for this issue.",
        "URL": "https://github.com/nextcloud/mail/pull/7797",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/mail",
        "CVE_ID": "CVE-2023-25160",
        "Problem_Type": "CWE-639",
        "Description": "Nextcloud Mail is an email app for the Nextcloud home server platform. Prior to versions 2.2.1, 1.14.5, 1.12.9, and 1.11.8, an attacker can access the mail box by ID getting the subjects and the first characters of the emails. Users should upgrade to Mail 2.2.1 for Nextcloud 25, Mail 1.14.5 for Nextcloud 22-24, Mail 1.12.9 for Nextcloud 21, or Mail 1.11.8 for Nextcloud 20 to receive a patch. No known workarounds are available.",
        "URL": "https://github.com/nextcloud/mail/pull/7740",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/mail",
        "CVE_ID": "CVE-2023-33184",
        "Problem_Type": "CWE-918",
        "Description": "Nextcloud Mail is a mail app in Nextcloud. A blind SSRF attack allowed to send GET requests to services running in the same web server. It is recommended that the Mail app is update to version 3.02, 2.2.5 or 1.15.3.\n\n",
        "URL": "https://github.com/nextcloud/mail/pull/8275",
        "Tag": "['Patch']"
    },
    {
        "repo_name": "nextcloud/mail",
        "CVE_ID": "CVE-2023-45660",
        "Problem_Type": "CWE-918",
        "Description": "Nextcloud mail is an email app for the Nextcloud home server platform. In affected versions a missing check of origin, target and cookies allows for an attacker to abuse the proxy endpoint to denial of service a third server. It is recommended that the Nextcloud Mail is upgraded to 2.2.8 or 3.3.0. There are no known workarounds for this vulnerability.",
        "URL": "https://github.com/nextcloud/mail/pull/8459",
        "Tag": "['Issue Tracking', 'Patch']"
    },
    {
        "repo_name": "nextcloud/mail",
        "CVE_ID": "CVE-2023-48307",
        "Problem_Type": "CWE-918",
        "Description": "Nextcloud Mail is the mail app for Nextcloud, a self-hosted productivity platform. Starting in version 1.13.0 and prior to version 2.2.8 and 3.3.0, an attacker can use an unprotected endpoint in the Mail app to perform a SSRF attack. Nextcloud Mail app versions 2.2.8 and 3.3.0 contain a patch for this issue. As a workaround, disable the mail app.",
        "URL": "https://github.com/nextcloud/mail/pull/8709",
        "Tag": "['Issue Tracking', 'Patch']"
    }
]