[
    {
        "repo_name": "nextcloud/richdocuments",
        "CVE_ID": "CVE-2021-37628",
        "Problem_Type": "CWE-639",
        "Description": "Nextcloud Richdocuments is an open source collaborative office suite. In affected versions the File Drop features (\"Upload Only\" public link shares in Nextcloud) can be bypassed using the Nextcloud Richdocuments app. An attacker was able to read arbitrary files in such a share. It is recommended that the Nextcloud Richdocuments is upgraded to 3.8.4 or 4.2.1. If upgrading is not possible then it is recommended to disable the Richdocuments application.",
        "URL": "https://github.com/nextcloud/richdocuments/pull/1664",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "18824a97ab4200f151c7589f0787b2f2b3d61c1a"
    },
    {
        "repo_name": "nextcloud/richdocuments",
        "CVE_ID": "CVE-2021-39223",
        "Problem_Type": "NVD-CWE-noinfo",
        "Description": "Nextcloud is an open-source, self-hosted productivity platform. The Nextcloud Richdocuments application prior to versions 3.8.6 and 4.2.3 returned verbatim exception messages to the user. This could result in a full path disclosure on shared files. (e.g. an attacker could see that the file `shared.txt` is located within `/files/$username/Myfolder/Mysubfolder/shared.txt`). It is recommended that the Richdocuments application is upgraded to 3.8.6 or 4.2.3. As a workaround, disable the Richdocuments application in the app settings.",
        "URL": "https://github.com/nextcloud/richdocuments/pull/1760",
        "Tag": "['Patch', 'Third Party Advisory']",
        "fix_commit_hash": "08c0d9ebe3f0e975fbef2b376d148095f29f19b5"
    },
    {
        "repo_name": "nextcloud/richdocuments",
        "CVE_ID": "CVE-2022-31024",
        "Problem_Type": "CWE-284",
        "Description": "richdocuments is the repository for NextCloud Collabra, the app for Nextcloud Office collaboration. Prior to versions 6.0.0, 5.0.4, and 4.2.6, a user could be tricked into working against a remote Office by sending them a federated share. richdocuments versions 6.0.0, 5.0.4 and 4.2.6 contain a fix for this issue. There are currently no known workarounds available.",
        "URL": "https://github.com/nextcloud/richdocuments/pull/2161",
        "Tag": "['Issue Tracking', 'Patch', 'Third Party Advisory']",
        "fix_commit_hash": "10235f21d84e69159b6b3e8d9317177465304594"
    },
    {
        "repo_name": "nextcloud/richdocuments",
        "CVE_ID": "CVE-2023-25150",
        "Problem_Type": "CWE-732",
        "Description": "Nextcloud office/richdocuments is an office suit for the nextcloud server platform. In affected versions the Collabora integration can be tricked to provide access to any file without proper permission validation. As a result any user with access to Collabora can obtain the content of other users files. It is recommended that the Nextcloud Office App (Collabora Integration) is updated to 7.0.2 (Nextcloud 25), 6.3.2 (Nextcloud 24), 5.0.10 (Nextcloud 23), 4.2.9 (Nextcloud 21-22), or 3.8.7 (Nextcloud 15-20). There are no known workarounds for this issue.",
        "URL": "https://github.com/nextcloud/richdocuments/pull/2669",
        "Tag": "['Patch', 'Vendor Advisory']",
        "fix_commit_hash": "b51562de1349d3648367de73c8d114f2ed91529a"
    },
    {
        "repo_name": "nextcloud/richdocuments",
        "CVE_ID": "CVE-2023-28645",
        "Problem_Type": "CWE-284",
        "Description": "Nextcloud richdocuments is a Nextcloud app integrating the office suit Collabora Online. In affected versions the secure view feature of the rich documents app can be bypassed by using unprotected internal API endpoint of the rich documents app. It is recommended that the Nextcloud Office app (richdocuments) is upgraded to 8.0.0-beta.1, 7.0.2 or 6.3.2. Users unable to upgrade may mitigate the issue by taking steps to restrict the ability to download documents. This includes ensuring that the `WOPI configuration` is configured to only serve documents between Nextcloud and Collabora. It is highly recommended to define the list of Collabora server IPs as the allow list within the Office admin settings of Nextcloud.",
        "URL": "https://github.com/nextcloud/richdocuments/pull/2604",
        "Tag": "['Patch', 'Vendor Advisory']",
        "fix_commit_hash": "eeb50a310efcf9174171724a9d06e4e0e9166571"
    }
]